[
    {
        "arab": "رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الْآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ",
        "indo": "Ya Tuhan kami, berilah kami kebaikan di dunia dan kebaikan di akhirat, dan lindungilah kami dari azab neraka.",
        "judul": "Doa Mohon Kebaikan Dunia dan Akhirat",
        "source": "quran"
    },
    {
        "arab": "رَبَّنَا أَفْرِغْ عَلَيْنَا صَبْرًا وَثَبِّتْ أَقْدَامَنَا وَانْصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ",
        "indo": "Ya Tuhan, limpahkanlah kesabaran atas diri kami, kokohkanlah pendirian kami, serta tolonglah kami dalam mengalahkan orang-orang kafir.",
        "judul": "Doa Tabah Menghadapi Lawan",
        "source": "quran"
    },
    {
        "arab": "رَبَّنَا لَا تُزِغْ قُلُوبَنَا بَعْدَ إِذْ هَدَيْتَنَا وَهَبْ لَنَا مِنْ لَدُنْكَ رَحْمَةً ۚ إِنَّكَ أَنْتَ الْوَهَّابُ",
        "indo": "Ya Tuhan, janganlah Engkau jadikan hati kami condong kepada kesesatan sesudah Engkau berikan petunjuk kepada kami, dan karuniakanlah kepada kami rahmat dari sisiMu. Sungguh hanya Engkaulah Yang Maha Pemberi karunia.",
        "judul": "Doa Diberi Keteguhan Iman",
        "source": "quran"
    },
    {
        "arab": "رَبَّنَآ إِنَّنَآ ءَامَنَّا فَٱغْفِرْ لَنَا ذُنُوبَنَا وَقِنَا عَذَابَ ٱلنَّارِ",
        "indo": "Ya Allah, sungguh kami telah beriman, maka ampunilah segala dosa kami dan selamatkanlah kami dari siksa neraka.",
        "judul": "Doa Kekuatan Iman",
        "source": "quran"
    },
    {
        "arab": "رَّبَّنَآ إِنَّنَا سَمِعْنَا مُنَادِيًا يُنَادِى لِلْإِيمَٰنِ أَنْ ءَامِنُوا۟ بِرَبِّكُمْ فَـَٔامَنَّا ۚ رَبَّنَا فَٱغْفِرْ لَنَا ذُنُوبَنَا وَكَفِّرْ عَنَّا سَيِّـَٔاتِنَا وَتَوَفَّنَا مَعَ ٱلْأَبْرَارِ • رَبَّنَا وَءَاتِنَا مَا وَعَدتَّنَا عَلَىٰ رُسُلِكَ وَلَا تُخْزِنَا يَوْمَ ٱلْقِيَٰمَةِ ۗ إِنَّكَ لَا تُخْلِفُ ٱلْمِيعَادَ",
        "indo": "Ya Tuhan kami, sesungguhnya kami mendengar (seruan) yang menyeru kepada iman, (yaitu): \"Berimanlah kamu kepada Tuhanmu\", maka kamipun beriman. Ya Tuhan kami, ampunilah bagi kami dosa-dosa kami dan hapuskanlah dari kami kesalahan-kesalahan kami, dan wafatkanlah kami beserta orang-orang yang banyak berbakti. Ya Tuhan kami, berilah kami apa yang telah Engkau janjikan kepada kami dengan perantaraan rasul-rasul Engkau. Dan janganlah Engkau hinakan kami di hari kiamat. Sesungguhnya Engkau tidak menyalahi janji.",
        "judul": "Doa Husnul Khatimah",
        "source": "quran"
    },
    {
        "arab": "رَبَّنَا ظَلَمْنَا أَنفُسَنَا وَإِن لَّمْ تَغْفِرْ لَنَا وَتَرْحَمْنَا لَنَكُونَنَّ مِنَ الْخَاسِرِينَ",
        "indo": "Wahai Tuhan kami, kami telah berlaku dzalim pada diri kami. Jika Engkau tidak mengampuni kami dan mengasihi kami, niscaya kami termasuk orang-orang yang rugi.",
        "judul": "Doa Penyesalan ( Istighfar Nabi Adam )",
        "source": "quran"
    },
    {
        "arab": "رَبَّنَا لَا تَجْعَلْنَا مَعَ الْقَوْمِ الظّٰلِمِيْنَ",
        "indo": "Ya Tuhan, janganlah Engkau \r\ntempatkan kami bersama-sama dengan orangorang zhalim.",
        "judul": "Doa Mohon Perlindungan dari Api Neraka",
        "source": "quran"
    },
    {
        "arab": "رَبَّنَا ٱفْتَحْ بَيْنَنَا وَبَيْنَ قَوْمِنَا بِٱلْحَقِّ وَأَنتَ خَيْرُ ٱلْفَٰتِحِينَ",
        "indo": "Ya Allah, berilah keputusan antara kami dan kaum kami dengan haq (adil). Engkaulah Pemberi keputusan yang sebaik-baiknya.",
        "judul": "Doa Mohon Keadilan",
        "source": "quran"
    },
    {
        "arab": "رَبَّنَا لَا تَجْعَلْنَا فِتْنَةً لِّلْقَوْمِ ٱلظَّٰلِمِينَ • وَنَجِّنَا بِرَحْمَتِكَ مِنَ ٱلْقَوْمِ ٱلْكَٰفِرِينَ",
        "indo": "Ya Tuhan, janganlah Engkau \r\njadikan kami sasaran fitnah bagi kaum yang \r\nzhalim, dan selamatkanlah kami dengan curahan \r\nrahmat-Mu dari tipu daya orang- orang yang \r\nkafir.",
        "judul": "Doa Mohon Keselamatan",
        "source": "quran"
    },
    {
        "arab": "رَبِّ إِنِّىٓ أَعُوذُ بِكَ أَنْ أَسْـَٔلَكَ مَا لَيْسَ لِى بِهِۦ عِلْمٌ ۖ وَإِلَّا تَغْفِرْ لِى وَتَرْحَمْنِىٓ أَكُن مِّنَ ٱلْخَٰسِرِينَ",
        "indo": "Ya Tuhanku, sesungguhnya aku berlindung kepada Engkau dan memohon kepada Engkau sesuatu yang aku tiada mengetahui (hakikat)nya. Dan sekiranya Engkau tidak memberi ampun kepadaku, dan (tidak) menaruh belas kasihan kepadaku, niscaya aku akan termasuk orang-orang yang merugi.",
        "judul": "Doa Mohon Perlindungan",
        "source": "quran"
    },
    {
        "arab": "رَبَّنَا اغْفِرْ لِي وَلِوَالِدَيَّ وَلِلْمُؤْمِنِينَ يَوْمَ يَقُومُ الْحِسَابُ",
        "indo": "Wahai Tuhanku, ampunilah aku dan kedua orangtuaku serta orang-orang mukmin pada hari perhitungan amal di akhirat.",
        "judul": "Doa Permohonan Ampunan",
        "source": "quran"
    },
    {
        "arab": "رَبِّ أَدْخِلْنِي مُدْخَلَ صِدْقٍ وَأَخْرِجْنِي مُخْرَجَ صِدْقٍ وَاجْعَلْ لِي مِنْ لَدُنْكَ سُلْطَانًا نَصِيرًا",
        "indo": "Ya Allah, masukkanlah aku dengan cara masuk yang benar, dan keluarkanlah aku dengan cara yang benar. Dan berikan padaku kekuasaan (pemimpin) sebagai penolong.",
        "judul": "Doa Mohon Tempat yang Baik",
        "source": "quran"
    },
    {
        "arab": "رَبَّنَآ اٰتِنَا مِنْ لَّدُنْكَ رَحْمَةً وَّهَيِّئْ لَنَا مِنْ اَمْرِنَا رَشَدًا",
        "indo": "Ya Tuhan kami, berikanlah rahmat kepada kami dari sisi -Mu dan sempurnakanlah bagi kami petunjuk yang lurus dalam urusan kami ini.",
        "judul": "Doa Mohon diberi Kemudahan",
        "source": "quran"
    },
    {
        "arab": "رَبِّ اشْرَحْ لِيْ صَدْرِيْ ۙ • وَيَسِّرْ لِيْٓ اَمْرِيْ ۙ • وَاحْلُلْ عُقْدَةً مِّنْ لِّسَانِيْ ۙ • يَفْقَهُوْا قَوْلِيْ",
        "indo": "Wahai Tuhanku, lapangkanlah dadaku, mudahkanlah untukku urusanku, dan lepaskanlah kekakuan dari lidahku, agar mereka mengerti perkataanku.",
        "judul": "Doa Kelapangan Hati",
        "source": "quran"
    },
    {
        "arab": "رَبِّ لَا تَذَرْنِيْ فَرْدًا وَ أَنْتَ خَيْرُ الْوَارِثِيْنَ • رَبِّ هَبْ لِيْ مِنْ لَّدُنْكَ ذُرِّيَّةً طَيِّبَةًۚ اِنَّكَ سَمِيْعُ الدُّعَاۤءِ",
        "indo": "Ya Tuhanku, janganlah Engkau biarkan aku hidup seorang diri (tanpa keturunan) dan Engkaulah ahli waris yang terbaik • Ya Tuhanku, berilah aku keturunan yang baik dari sisi-Mu, sesungguhnya Engkau Maha Mendengar doa.",
        "judul": "Doa Mohon Jodoh dan Keturunan yang Baik",
        "source": "quran"
    },
    {
        "arab": "رَبِّ أَعُوذُ بِكَ مِنْ هَمَزَاتِ الشَّيَاطِينِ • وَأَعُوذُ بِكَ رَبِّ أَنْ يَحْضُرُونِ",
        "indo": "Ya Tuhanku aku berlindung kepada Engkau dari bisikan-bisikan syaitan • Dan aku berlindung (pula) kepada Engkau ya Tuhanku, dari kedatangan mereka kepadaku",
        "judul": "Doa Terhindar dari Godaan Syaiton",
        "source": "quran"
    },
    {
        "arab": "رَبَّنَا اصْرِفْ عَنَّا عَذَابَ جَهَنَّمَ ۖ اِنَّ عَذَابَهَا كَانَ غَرَامًا",
        "indo": "Ya Tuhan kami, jauhkanlah azab Jahanam dari kami, sungguh azab itu adalah kebinasaan yang kekal.",
        "judul": "Doa Mohon Perlindungan dari Azab Neraka Jahannam",
        "source": "quran"
    },
    {
        "arab": "رَبِّ أَوْزِعْنِي أَنْ أَشْكُرَ نِعْمَتَكَ الَّتِي أَنْعَمْتَ عَلَيَّ وَعَلَى وَالِدَيَّ وَأَنْ أَعْمَلَ صَالِحًا تَرْضَاهُ وَأَصْلِحْ لِي فِي ذُرِّيَّتِي إِنِّي تُبْتُ إِلَيْكَ وَإِنِّي مِنَ الْمُسْلِمِينَ",
        "indo": "Ya Tuhanku berilah aku ilham untuk tetap mensyukuri nikmat-Mu yang telah Engkau anugerahkan kepadaku dan kepada dua orang ibu bapakku dan untuk mengerjakan amal saleh yang Engkau ridai; dan masukkanlah aku dengan rahmat-Mu ke dalam golongan hamba-hamba-Mu yang saleh.",
        "judul": "Doa Mensyukuri Ni'mat",
        "source": "quran"
    },
    {
        "arab": "رَبَّنَا وَسِعْتَ كُلَّ شَيْءٍ رَّحْمَةً وَّعِلْمًا فَاغْفِرْ لِلَّذِيْنَ تَابُوْا وَاتَّبَعُوْا سَبِيْلَكَ وَقِهِمْ عَذَابَ الْجَحِيْمِ • رَبَّنَا وَاَدْخِلْهُمْ جَنّٰتِ عَدْنِ ِۨالَّتِيْ وَعَدْتَّهُمْ وَمَنْ صَلَحَ مِنْ اٰبَاۤىِٕهِمْ وَاَزْوَاجِهِمْ وَذُرِّيّٰتِهِمْ ۗاِنَّكَ اَنْتَ الْعَزِيْزُ الْحَكِيْمُۙ",
        "indo": "Ya Tuhan kami, rahmat dan ilmu yang ada pada-Mu meliputi segala sesuatu, maka berilah ampunan kepada orang-orang yang bertobat dan mengikuti jalan (agama)-Mu dan peliharalah mereka dari azab neraka yang menyala-nyala. Ya Tuhan kami, masukkanlah mereka ke dalam surga ‘Adn yang telah Engkau janjikan kepada mereka, dan orang yang saleh di antara nenek moyang mereka, istri-istri, dan keturunan mereka. Sungguh, Engkaulah Yang Mahaperkasa, Mahabijaksana.",
        "judul": "Doa Mohon Keluasan Rahmat",
        "source": "quran"
    },
    {
        "arab": "رَبَّنَا ٱغْفِرْ لَنَا وَلِإِخْوَٰنِنَا ٱلَّذِينَ سَبَقُونَا بِٱلْإِيمَٰنِ وَلَا تَجْعَلْ فِى قُلُوبِنَا غِلًّا لِّلَّذِينَ ءَامَنُوا۟ رَبَّنَآ إِنَّكَ رَءُوفٌ رَّحِيمٌ",
        "indo": "Ya Tuhan kami, ampunilah dosa-dosa kami dan dosadosa saudara-saudara kami yang telah mendahului kami dengan membawa iman, dan janganlah Engkau membiarkan kedengkian dalam hati kami terhadap orang-orang yang beriman. Ya Tuhan kami, sungguh Engkau Maha Penyantun lagi Maha Penyayang.",
        "judul": "Doa Selamat dari Kedengkian",
        "source": "quran"
    },
    {
        "arab": "رَّبَّنَا عَلَيْكَ تَوَكَّلْنَا وَإِلَيْكَ أَنَبْنَا وَإِلَيْكَ ٱلْمَصِيرُ رَبَّنَا لَا تَجْعَلْنَا فِتْنَةً لِّلَّذِينَ كَفَرُوا۟ وَٱغْفِرْ لَنَا رَبَّنَآ ۖ إِنَّكَ أَنتَ ٱلْعَزِيزُ ٱلْحَكِيمُ",
        "indo": "Ya Tuhan kami, hanya kepada Engkaulah kami bertawakal, hanya kepada Engkaulah kami bertaubat, dan hanya kepada Engkaulah kami kembali. Ya Tuhan kami, janganlah Engkau jadikan kami sasaran fitnah bagi orang-orang kafir. Ya Tuhan kami, ampunilah dosa-dosa kami. Sungguh hanya Engkau Yang Maha Perkasa lagi Maha Bijaksana.",
        "judul": "Doa Bertawakkal Kepada Allah",
        "source": "quran"
    },
    {
        "arab": "رَبَّنَا مَا خَلَقْتَ هَٰذَا بَاطِلًا سُبْحَانَكَ فَقِنَا عَذَابَ النَّارِ",
        "indo": "Ya Tuhan kami, tiadalah Engkau menciptakan alam ni dengan sia-sia. Maha Suci Engkau, maka selamatkanlah kami dari siksa neraka.",
        "judul": "Doa Melihat Keajaiban Alam",
        "source": "quran"
    },
    {
        "arab": "رَبَّنَآ اَخْرِجْنَا مِنْ هٰذِهِ الْقَرْيَةِ الظَّالِمِ اَهْلُهَاۚ وَاجْعَلْ لَّنَا مِنْ لَّدُنْكَ وَلِيًّاۚ وَاجْعَلْ لَّنَا مِنْ لَّدُنْكَ نَصِيْرًا",
        "indo": "Ya Tuhan kami, keluarkanlah kami dari negeri ini (Mekah) yang penduduknya zalim. Berilah kami pelindung dari sisi-Mu, dan berilah kami penolong dari sisi-Mu.",
        "judul": "Doa Mohon Perlindungan dari Orang-orang Dzalim",
        "source": "quran"
    },
    {
        "arab": "اللّٰهُمَّ رَبَّنَآ اَنْزِلْ عَلَيْنَا مَاۤىِٕدَةً مِّنَ السَّمَاۤءِ تَكُوْنُ لَنَا عِيْدًا لِّاَوَّلِنَا وَاٰخِرِنَا وَاٰيَةً مِّنْكَ وَارْزُقْنَا وَاَنْتَ خَيْرُ الرّٰزِقِيْنَ",
        "indo": "Ya Allah Tuhan kami, turunkanlah kepada kami hidangan dari langit (yang hari turunnya) akan menjadi hari raya bagi kami, yaitu bagi orang-orang yang sekarang bersama kami maupun yang datang setelah kami, dan menjadi tanda bagi kekuasaan-Mu. Berilah kami rezeki. Engkaulah sebaik-baik pemberi rezeki.",
        "judul": "Doa Mohon Rizqi",
        "source": "quran"
    },
    {
        "arab": "رَبِّ أَنْزِلْنِي مُنْزَلًا مُبَارَكًا وَأَنْتَ خَيْرُ الْمُنْزِلِينَ",
        "indo": "Ya Tuhanku, tempatkanlah aku pada tempat yang diberkati, dan Engkau adalah sebaik-baik Yang memberi tempat.",
        "judul": "Doa Agar Diberi Kedudukan yang Mulia",
        "source": "quran"
    },
    {
        "arab": "رَبِّ هَبْ لِى حُكْمًا وَأَلْحِقْنِى بِٱلصَّٰلِحِينَ وَٱجْعَل لِّى لِسَانَ صِدْقٍ فِى ٱلْءَاخِرِينَ وَٱجْعَلْنِى مِن وَرَثَةِ جَنَّةِ ٱلنَّعِيمِ",
        "indo": "Ya Tuhanku, berikanlah kepadaku hikmah dan pertemukanlah aku dengan orang-orang yang shalih, serta jadikanlah aku buah tutur yang baik bagi orang yang datang kemudian. Dan jadikanlah aku termasuk golongan orang-orang yang mewarisi sorga yang penuh nikmat.",
        "judul": "Doa Agar Diberi Hikmah",
        "source": "quran"
    },
    {
        "arab": "رَبِّ ٱبْنِ لِى عِندَكَ بَيْتًا فِى ٱلْجَنَّةِ وَنَجِّنِى مِن فِرْعَوْنَ وَعَمَلِهِۦ وَنَجِّنِى مِنَ ٱلْقَوْمِ ٱلظَّٰلِمِينَ",
        "indo": "Ya Tuhanku, bangunlah untukku sebuah rumah di sisi-Mu dalam sorga, dan selamatkanlah aku dari Fir'aun dan perbuatannya, serta selamatkanlah aku dari kaum yang zhalim.",
        "judul": "Doa Agar Diberi Bangunan Indah di Surga",
        "source": "quran"
    },
    {
        "arab": "رَّبِّ ٱغْفِرْ لِى وَلِوَٰلِدَىَّ وَلِمَن دَخَلَ بَيْتِىَ مُؤْمِنًا وَلِلْمُؤْمِنِينَ وَٱلْمُؤْمِنَٰتِ وَلَا تَزِدِ ٱلظَّٰلِمِينَ إِلَّا تَبَارًۢا",
        "indo": "Ya Tuhanku, ampunilah dosa- dosaku dan dosa kedua ibu-bapakku, serta dosa orang yang masuk ke rumahku dengan membawa iman, dan orang beriman laki-laki maupun perempuan. Dan janganlah Engkau tambahkan bagi orang-orang yang zalim itu selain kebinasaan.",
        "judul": "Doa Agar Terhindar dari orang-orang Zhalim",
        "source": "quran"
    },
    {
        "arab": "لَا إِلَهَ إِلَّا أَنْتَ سُبْحَانَكَ إِنِّي كُنْتُ مِنَ الظَّالِمِينَ",
        "indo": "Tidak ada tuhan selain Engkau, Maha Suci Engkau. Sungguh, aku termasuk orang-orang yang zalim.",
        "judul": "Doa Agar Terlepas dari Kesulitan / Istigfar \r\nNabi Yunus",
        "source": "quran"
    },
    {
        "arab": "رَبَّنَآ أَتْمِمْ لَنَا نُورَنَا وَٱغْفِرْ لَنَآ ۖ إِنَّكَ عَلَىٰ كُلِّ شَىْءٍ قَدِيرٌ",
        "indo": "Ya Rabb kami, sempurnakanlah bagi kami cahaya kami dan ampunilah kami; Sesungguhnya Engkau Maha Kuasa atas segala sesuatu.",
        "judul": "Doa Agar diberi Cahaya dan Ampunan",
        "source": "quran"
    },
    {
        "arab": "اَللَّهُمَّ اِغْفِرْ لِي مَا قَدَّمْتُ وَمَا أَخَّرْتُ وَمَا أَسْرَرْتُ وَمَا أَعْلَنْتُ وَمَا أَنْتَ أَعْلَمُ بِهِ مِنِّي",
        "indo": "Ya Allah, ampunilah kesalahan, \r\nkebodohan dan keterlaluanku dalam segala \r\nurusan, dan ampuni pula segala dosa yang \r\nEngkau lebih mengetahui daripada aku.",
        "judul": "Doa Mohon Ampunan Dosa",
        "source": "hadits"
    },
    {
        "arab": "اللَّهُمَّ أصْلِحْ لِي دِيْنِيَ الَّذِي هُوَ عِصْمَةُ أَمْرِي ، وَأَصْلِحْ لِي دُنْيَايَ الَّتِي فِيهَا مَعَاشِي ، وَأَصْلِحْ لِي آخِرتِي الَّتي فِيهَا مَعَادِي ، وَاجْعَلِ الحَيَاةَ زِيَادَةً لِي فِي كُلِّ خَيْرٍ ، وَاجْعَلِ المَوتَ رَاحَةً لِي مِنْ كُلِّ شَرٍّ",
        "indo": "Ya Allah, perbaikilah urusan \r\nagamaku yang menjadi pegangan bagi setiap \r\nurusanku. Perbaikilah duniaku yang di situlah \r\nurusan kehidupanku. Perbaikilah akhiratku yang \r\nke sanalah aku akan kembali. Jadikanlah hidupku \r\nini sebagai tambahan kesempatan untuk \r\nmemperbanyak amal kebajikan, dan jadikanlah\r\nkematianku sebagai tempat peristirahatan dari \r\nsetiap kejahatan.",
        "judul": "Doa Kebaikan Dunia Akhirat",
        "source": "hadits"
    },
    {
        "arab": "اَللَّهُمَّ اِنِّى اَسْأَلُكَ رَحمَةً مِنْ عِنْدِكَ تُهْدِى بِهَا قلْبِى، وَتَجْمَعُ بِها شَمْلِى. وَتَرُدَّ بِهَا الْفِتْنَ عَنِّى وَتُصْلِحُ بِهَا دِيْنِى وَتَحْفَظُ بِها غَائِبِى وَتَرْفَعُ بِهَا شَاهِدِى وَتُزَكِّى بِهَا عَمَلِى.ضُ بِهَا وَجْهِى وَتُلْهِمُنِى بِهَا رُشْدِى وَتُبَيِّ وَتُعْصِمُنِى بِهَا مِنْ كُلِّ سُوْءٍ",
        "indo": "Ya Allah, aku memohon kepada-\r\nMu curahan rahmat dari sisi-Mu, yang \r\ndengannya hatiku mendapat petunjuk, \r\nterkumpul segala yang bercerai-berai dan \r\nterhimpun segala yang terpisah-pisah, tertolak \r\nsegala fitnah atas diriku dan bertambah baik \r\nurusan agamaku, terpelihara segala sesuatu \r\nyang jauh dariku dan terangkat apa yang dekat \r\ndenganku, disucikan segala perbuatanku dan \r\ndicerahkan wajahku, diberi ilham menuju \r\npetunjuk dan terpelihara diriku dari segala \r\nsesuatu yang jelek.",
        "judul": "Doa Mohon Petunjuk Allah",
        "source": "hadits"
    },
    {
        "arab": "اللَّهُمَّ إِنِّي ظَلَمتُ نَفْسِي ظُلْمًا كَثِيرًا، وَلاَ يَغْفِرُ الذُّنُوبَ إِلاَّ أنْتَ، فَاغْفِرْ لي مَغْفِرَةً مِنْ عِنْدِكَ، وارْحَمْنِي، إنَّكَ أنْتَ الغَفُورُ الرَّحِيمُ",
        "indo": "Ya Allah, aku telah banyak \r\nberbuat zhalim terhadap diriku sendiri, dan \r\ntidak ada yang dapat mengampuni dosa kecuali \r\nEngkau, maka curahkanlah ampunan dan belas \r\nkasih kepadaku dari sisi-Mu. Sungguh Engkau \r\nMaha Pengampun lagi Maha Penyayang.",
        "judul": "Doa Mohon Curahan Rahmat dan Ampunan",
        "source": "hadits"
    },
    {
        "arab": "اَللَّهُمَّ أَنْتَ رَبِّيْ لاَ إِلَـهَ إِلاَّ أَنْتَ، خَلَقْتَنِيْ وَأَنَا عَبْدُكَ، وَأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ، أَعُوْذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ، أَبُوْءُ لَكَ بِنِعْمَتِكَ عَلَيَّ، وَأَبُوْءُ بِذَنْبِيْ فَاغْفِرْ لِيْ فَإِنَّهُ لاَ يَغْفِرُ الذُّنُوْبَ إِلاَّ أَنْتَ",
        "indo": "Ya Allah, Engkau adalah \r\nTuhanku, yang tiada Tuhan yang pantas \r\ndisembah melainkan Engkau.yang telah \r\nmenciptakan diriku. Aku adalah hamba-Mu, dan \r\naku berada dalam perintah dan perjanjian-Mu, \r\nyang dengan segala kemampuanku perintah-Mu \r\naku laksanakan. Aku berlindung kepada-Mu \r\ndari segala kejelekan yang aku perbuat terhadap-\r\nMu. Engkau telah mencurahkan nikmat-Mu \r\nkepadaku, sementara aku senantiasa berbuat \r\ndosa. Maka ampunilah dosa-dosaku. Sebab tidak \r\nada yang dapat mengampuni dosa kecuali \r\nEngkau.",
        "judul": "Doa Sayyidul Istighfar",
        "source": "hadits"
    },
    {
        "arab": "اللَّهُمَّ عَافِنِي فِي بَدَنِي، اللَّهُمَّ عَافِنِي فِي سَمْعِي، اللَّهُمَّ عَافِنِي فِي بَصَرِي، لَا إِلَهَ إِلَّا أَنْتَ",
        "indo": "Ya Allah, berilah kesehatan \r\npada badanku. Ya Allah, berilah kesehatan pada \r\npendengaranku. Ya Allah, berilah kesehatan \r\npada penglihatanku. Tidak ada Tuhan yang pantas disembah \r\nkecuali Engkau.",
        "judul": "Doa Kesehatan Lahir Batin",
        "source": "hadits"
    },
    {
        "arab": "اللَّهُمَّ إِنَّكَ عَفُوٌّ تُحِبُّ الْعَفْوَ فَاعْفُ عَنِّي",
        "indo": "Ya Allah, sesungguhnya Engkau Maha Pemaaf, dan Engkau suka memberi maaf, maka maafkan aku.",
        "judul": "Doa Lailatul Qadar",
        "source": "hadits"
    },
    {
        "arab": "اَللَّهُمَّ اِنَّا نَسْأَلُكَ مِنْ كُلِّ خَيْرٍ مَا سَأَلَكَ مِنْه نَبِيُّكَ مُحَمَّدٌ، وَنعَوْذُبِكَ مِنْ كُلِّ شَرٍّ مَااسْتَعَاذَكَ مِنْه نَبِيُّكَ مُحَمَّدٌ .وَاَنْتَ الْمُسْتَعَانُ وَعَلَيْكَ الْبَلاَغ وَلاَحَوْلَ ولَا قَوَّة اِلا بِاللهِ",
        "indo": "Ya Allah, aku memohon \r\nkepada-Mu segala kebajikan sebagaimana yang \r\ndimohon oleh nabi-Mu Muhamad. Dan aku \r\nberlindung kepada-Mu dari segala kejelekan \r\nsebagajmana yang nabi-Mu Muhamad mohon \r\nperlindungan. Engkaulah Yang Maha Pemberi \r\nPertolongan, dan kepada-Mulah puncak segala \r\npengharapan. Tiada daya upaya untuk \r\nmeninggalkan ma'siat dan tiada kekuatan untuk\r\nmelakukan ibadah kecuali atas pertolongan \r\nAllah.",
        "judul": "Doa Berlindung dari Keburukan",
        "source": "hadits"
    },
    {
        "arab": "اَللَّهُمَّ اِنِّى اَسْأَلُكَ الثَّبَاتَ فِى الاَمْرِ وَاَسْأَلُكَ الْعَزِيْمَة فِى الرُّشْدِ. وَاَسْأَلُكَ شُكْرَ نِعْمَتِكَ وَحُسْنَ عِبَادَتِكَ وَاَسْأَلُكَ لِسَانًا صَادِقًا وَقَلْبًا سَلِيْمًا وَاَعُوْذُبِكَ مِنْ شَرِّ مَا تَعْلَمُ وَاَسْأَلُكَ مِنْ خَيْرِ مَا تَعْلَمُ، وَاَسْتَغْفِرُكَ مِمَّا تَعْلَمُ اِنَّكَ اَنْتَ عَلاَّمُ الْغُيُوْبِ",
        "indo": "Ya Allah, aku memohon \r\nkepada-Mu ketegaran dalam menghadapi segala \r\npermasalahan. Aku memohon dengan sangat \r\nkepada-Mu untuk berkenan memberikan \r\ncurahan petunjuk, serta aku memohon kepada-\r\nMu dapat mensyukuri nikmat dan rajin \r\nmelakukan ibadah. Aku mernohon kepada-Mu \r\nlisan yang jujur dan hati yang lurus. Aku \r\nberlindung kepada-Mu dari kejelekan yang \r\nEngkau ketahui, dan aku memohon kepada-Mu \r\nkebaikan yang Engkau ketahui, serta aku \r\nmemohon kepada-Mu curahan ampunan dari \r\nsegala dosa yang Engkau ketahui. Sebab hanya \r\nEngkaulah Yang Maha Mengetahui segala yang \r\nghaib.",
        "judul": "Doa Teguh Pendirian",
        "source": "hadits"
    },
    {
        "arab": "اَللَّهُمَّ صَلِّ عَلَى سَيِّدِنَا مُحَمَّدٍعَدَدَ اَنْوَاعِ الرِّزْقِ وَالْفُتُوْحَاتِ، بَابَاسِطَ الَّذِيْ يبَْسُطُ الرِّزْقَ لِمَنْ يَشَآء بِغَيْرِحِسَابٍ اُبْسُطْ عَلَي رِزْقًا كَثِيْرًا مِنْ كُلِّ جِهَةٍ مِنْ خَزَائِنِ رِزْقِكَ بِغَيْرمِنَّةٍ مَخْلُوْقٍ بِفَضْلِكَ وَكَرَمِكَ وَعَلَى اَلِهِ وَصَحْبِهِ وَسَلَّمَ",
        "indo": "Wahai Allah limpahkanlah \r\nrahmat atas junjungan kita Nabi Muhammad \r\nSaw; sebanyak aneka rupa rizqi. Wahai Dzat \r\nYang Maha Meluaskan rizqi kepada orang yang \r\ndikehendaki-Nya tanpa hisab. Luaskan dan \r\nbanyakanlah rizqiku dari segenap setiap penjuru \r\ndan perbendaharaan rizqi-Mu tanpa pemberian \r\ndari makhluk, berkat kemurahan-Mu jua. Dan \r\nlimpahkanlah pula rahmat dan salam atas dan \r\npara sahabat beliau.",
        "judul": "Doa Pembuka Rizqi dari Setiap Penjuru",
        "source": "pilihan"
    },
    {
        "arab": "اَللَّهُمَّ يَاغَنِيُّ يَاحمِيْدُ يَامُبْدِئُ يَامُعِيْدُ يَارَحِيْمُ يَاوَدُوْدُ اَغْنِنِى بِحَلاَلِكَ عَنْ حَرَامِكَ وَاكْفِنِى بِفَضْلِكَ عَمَّنْ سِوَاكَ وَصَلَّى اللهُ عَلَى مُحَمَّدٍ وَاَلِهِ وَصَحْبِهِ وَسَلَّمَ",
        "indo": "Wahai Allah, wahai Dzat Yang \r\nMaha Kaya, wahai Dzat Yang Maha Terpuji, \r\nwahai Dzat Yang memulai, wahai Dzat Yang Mengembalikan, wahai Dzat Yang Maha \r\nPenyayang, wahai Dzat Yang Maha Mencintai. \r\nCukupilah kami dengan kehalalan-Mu dari \r\nkeharaman-Mu. Cukupilah kami dengan \r\nanugerah-Mu dari selain Engkau. Semoga Allah \r\nmelimpahkan rahmat dan salam atas junjungan \r\nkita Nabi Muhammad Saw. keluarga dan \r\nsahabat beliau.",
        "judul": "Doa untuk Mendapatkan Rizqi yang Halal",
        "source": "pilihan"
    },
    {
        "arab": "بِسْمِ اللهِ عَلَى نَفْسِي وَمَالِي وَدِيْنِي. اَللهُمَّ رَضِّنِى بِقَضَائِكَ وَبَارِكْ لِيْ فِيْمَا قُدِّرَ عَلَيْهِ حَتَّى لاَاُحِبُّ تَعْجِيْلَ مَااَخَّرْتَ وَلاَتَأْخِيْرَ مَاعَجَّلْتَ",
        "indo": "Dengan nama Allah, semoga \r\nEngkau menjaga diri kami, harta kami dan \r\nagama kami. Wahai Allah, ridhailah kami dari \r\nketetapan-Mu dan berilah berkah kepada kami pada segala apa yang telah Engkau putuskan \r\nsehingga kami Tidak suka apa yang Engkau \r\nmempercepatkan apa yang Engkau akhirkan dan \r\ntidak pula menyukai mengakhirkan apa yang, \r\nEngkau cepatkan.",
        "judul": "Doa Untuk Memudahkan Mata \r\nPencaharian",
        "source": "pilihan"
    },
    {
        "arab": "اللَّهُمَّ رَبَّ النَّاسِ مُذْهِبَ الْبَاسِ اشْفِ أَنْتَ الشَّافِى لاَ شَافِىَ إِلاَّ أَنْتَ ، شِفَاءً لاَ يُغَادِرُ سَقَمًا",
        "indo": "Ya Allah Wahai Tuhan segala manusia, hilangkanlah penyakitnya, sembukanlah ia. (Hanya) Engkaulah yang dapat menyembuhkannya, tidak ada kesembuhan melainkan kesembuhan dariMu, kesembuhan yang tidak kambuh lagi.",
        "judul": "Doa Menjenguk Orang Sakit",
        "source": "pilihan"
    },
    {
        "arab": "اللَّهُمَّ إنِّي أسْألُكَ مُوجِبَاتِ رَحْمَتِكَ، وَعَزَائِمَ مَغْفِرَتِكَ، والسَّلامَةَ مِنْ كُلِّ إثْمٍ، والغَنِيمَةَ مِنْ كُلِّ بِرٍّ ، والفَوْزَ بالجَنَّةِ ، والنَّجَاةَ مِنَ النَّارِ",
        "indo": "Ya Allah aku mohon kepada-\r\nMu segala hal yang mendatangkan rahmat-Mu \r\ndan keteguhan ampunan-Mu selamat dari segala dosa dan beruntung dengan mendapat berbagai \r\nkebaikan, beruntung memperoleh surge, \r\nterhindar dari siksa neraka.",
        "judul": "Doa Mohon Rahmat dan Ampunan",
        "source": "pilihan"
    },
    {
        "arab": "اَلْحَمْدُ ِللهِ الَّذِى أَحْيَانَا بَعْدَمَا أَمَاتَنَا وَإِلَيْهِ النُّشُورُ",
        "indo": "Segala puji bagi Allah yang menghidupkan kami kembali setelah mematikan kami dan kepada Allah kami akan dibangkitkan.",
        "judul": "Doa Ketika Bangun Tidur",
        "source": "harian"
    },
    {
        "arab": "اَلْحَمْدُ ِللهِ الَّذِيْ قَطْلَ الْحَاجَتِ",
        "indo": "Segala puji bagi Allah yang telah memberi hajatku",
        "judul": "Doa Ketika Mimpi Baik",
        "source": "harian"
    },
    {
        "arab": "أَللَّهُمَّ إِنِّى أَعُوْذُ بِكَ مِنْ عَمَلِ الشَّيْطَان وَسَيِّئاَتِ اْلأَحْلاَمِ",
        "indo": "Ya Allah, sesungguhnya aku berlindung kepada-Mu dari perbuatan setan dan dari mimpi-mimpi buruk.",
        "judul": "Doa Ketika Mimpi Buruk",
        "source": "harian"
    },
    {
        "arab": "اللَّهُمَّ إِنِّى أَعُوذُ بِكَ مِنَ الْخُبُثِ وَالْخَبَائِث",
        "indo": "Ya Allah, sesungguhnya aku berlindung kepada-Mu dari setan-setan lelaki dan setan-setan perempuan.",
        "judul": "Doa Masuk WC",
        "source": "harian"
    },
    {
        "arab": "اَللّٰهُمَّ حَسِّنْ فَرْجِىْ مِنَ الْفَوَاخِشِ وَظَهِّرْ قَلْبِيْ مِنَ النِّفَاقِ",
        "indo": "Ya Allah bersihkanlah farjiku (kemaluan) dari keburukan dan bersihkan hatiku dari nifaq (kemunafikan).",
        "judul": "Doa Istinja",
        "source": "harian"
    },
    {
        "arab": "الْحَمْدُ الِلّٰهِ الَّذِىْ اَذْهَبَ عَنِّى اْلاَذَى وَعَافَانِىْ",
        "indo": "Segala puji milik Allah yang telah menghilangkan kotoran dari badanku dan yang telah menyejahterakan.",
        "judul": "Doa Keluar WC",
        "source": "harian"
    },
    {
        "arab": "اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ خَيْرِهِ وَخَيْرِ مَا هُوَ لَهُ ، وَأَعُوْذُ بِكَ مِنْ شَرِّهِ وَشَرِّ مَا هُوَ لَهُ",
        "indo": "Ya Allah, Sesungguhnya aku memohon kepada-Mu kebaikan pakaian ini dan kebaikan sesuatu yang di dalamnya, dan aku berlindung kepada-Mu dari keburukan pakaian ini dan keburukan sesuatu yang ada di dalamnya.",
        "judul": "Doa Hendak Berpakaian",
        "source": "harian"
    },
    {
        "arab": "اَللّٰهُمَّ كَمَا حَسَّـنْتَ خَلْقِـيْ فَحَسِّـنْ خُلُقِـيْ",
        "indo": "Ya Allah sebagaimana Engkau telah ciptakan aku dengan baik, maka perbaikilah akhlakku.",
        "judul": "Doa Ketika Bercermin",
        "source": "harian"
    },
    {
        "arab": "اللَّهُمَّ بارِكْ لَنا فِيما رَزَقْتَنا وَقِنا عَذَابَ النَّارِ",
        "indo": "Ya Allah berkatilah rezeki yang telah kau limpahkan pada kami, dan peliharalah kami dari azab api neraka.",
        "judul": "Doa Sebelum Makan",
        "source": "harian"
    },
    {
        "arab": "اَلْحَمْدُ ِللهِ الَّذِيْنَ اَطْعَمَنَا وَسَقَانَا وَجَعَلَنَا مِنَ الْمُسْلِمِيْنَ",
        "indo": "Segala puji bagi Allah yang telah memberi kami makan dan minum serta menjadikan kami termasuk golongan orang muslim.",
        "judul": "Doa Sesudah Makan",
        "source": "harian"
    },
    {
        "arab": "اَللّٰهُمَّ هَوِّنْ عَلَيْنَا سَفَرَنَا هَذَا وَاطْوِعَنَّابُعْدَهُ اَللّٰهُمَّ اَنْتَ الصَّاحِبُ فِى السَّفَرِوَالْخَلِيْفَةُفِى الْاَهْلِ",
        "indo": "Ya Allah, mudahkanlah kami bepergian ini, dan dekatkanlah kejauhannya. Ya Allah yang menemani dalam bepergian, dan Engkau pula yang melindungi keluarga.",
        "judul": "Doa Berpergian",
        "source": "harian"
    },
    {
        "arab": "سُبْحَانَ الَّذِي سَخَّرَ لَنَا هَذَا وَمَا كُنَّا لَهُ مُقْرِنِينَ وَإِنَّا إِلَى رَبِّنَا لَمُنقَلِبُونَ",
        "indo": "Maha Suci Rabb yang menundukkan kendaraan ini untuk kami, padahal kami sebelumnya tidak mampu menguasainya. Dan sesungguhnya kami akan kembali kepada Robb kami (di hari kiamat).",
        "judul": "Doa Naik Kendaraan Darat",
        "source": "harian"
    },
    {
        "arab": "بِسْمِ اللهِ مَجْرَهَا وَمُرْسَهَآاِنَّ رَبِّىْ لَغَفُوْرٌرَّحِيْمٌ",
        "indo": "Dengan nama Allah yang menjalankan kendaraan ini berlayar dan berlabuh. Sesungguhnya Tuhanku benar-benar Maha Pengampun lagi Maha Penyayang.",
        "judul": "Doa Naik Kendaraan Laut",
        "source": "harian"
    },
    {
        "arab": "اَلْحَمْدُ ِللهِ الَّذِى سَلَمَنِى وَالَّذِى اَوَنِى وَالَّذِى جَمَعَ الشَّمْلَ بِئ",
        "indo": "Segala puji bagi Allah, yang telah menyelamatkan akau dan yang telah melindungiku dan yang mengumpulkanku dengan keluargaku.",
        "judul": "Doa Tiba ditempat Tujuan",
        "source": "harian"
    },
    {
        "arab": "بِسْمِ اللهِ الَّذِيْ لاَ إِلَهَ إِلَّا هُوَ",
        "indo": "Dengan nama Allah yang tiada Tuhan selain-Nya.",
        "judul": "Doa Melepas Pakaian",
        "source": "harian"
    },
    {
        "arab": "بِاسْمِكَ اللهُمَّ أَحْيَا وَأَمُوْتُ",
        "indo": "Dengan menyebut nama-Mu, Ya Allah, aku hidup dan dengan menyebut nama-Mu aku mati.",
        "judul": "Doa Sebelum Tidur",
        "source": "harian"
    },
    {
        "arab": "الحَمْدُ للهِ الَّذِي أَحْيَانَا بعْدَ مَا أماتَنَا وإِلَيْهِ النُّشُورُ",
        "indo": "Segala puji bagi Allah yang telah menghidupkan kami sesudah kami mati (membangunkan dari tidur) dan hanya kepada-Nya kami dikembalikan.",
        "judul": "Doa Setelah Bangun Tidur",
        "source": "harian"
    },
    {
        "arab": "أَعُوْذً بِكَلِمَاتِ اللهِ تَامَّةِ مِنْ غَضَبِهِ وَمِنْ شَرِّ عِبَادِهِ وَمِنْ هَمَزَاتِ الشَّيَاطِيْنِ وَأَنْ يَحْضُرُوْنَ",
        "indo": "Aku berlindung dengan kalimah Allah yang sempurna dari kemarahan Allah dari kejahatan hamba-hamba-Nya dan dari gangguan setan dan dari kehadiran mereka.",
        "judul": "Doa Terkejut Bangun Dari Tidur",
        "source": "harian"
    },
    {
        "arab": "لَاإِلٰهَ الاَّ أَنتَ سُبحَانَكَ اللّٰهُمَّ زِدْنِي عِلمًا وَلا تُزِغ قَلبِي بَعْدَ إِذْ هَدَيتَنِي وَهَب لِي مِن لَدُنكَ رَحمَةً إِنَّكَ أَنْتَ الْوَهَّابِ",
        "indo": "Tidak ada Tuhan melainkan Engkau, maha suci Engkau ya Allah, aku minta ampun kepada-Mu tentang dosa-dosaku, dan aku mohon rahmat-Mu tentang dosa-dosaku, dan aku mohon rahmat-Mu. Ya Allah, tambahlah ilmuku dan janganlah Engkau gelincirkan hatiku setelah Engkau memberi petunjuk kepadaku, dan karuniakanlah rahmat untuk-ku daripada-Mu, sesungguhnya Engkaulah yang maha Memberi.",
        "judul": "Doa Ketika Duduk Setelah Tidur",
        "source": "harian"
    },
    {
        "arab": "اَللَّهُمَّ إِنِّيْ أَعُوْذُ بِكَ مِنْ ضِيْقِ الدُّنْيَا وَضِيْقِ يَوْمِ اْلقِيَامَةِ",
        "indo": "Ya Allah, sesungguhnya aku berlindung kepada-Mu dari kesempitan dan kesempitan hari kiamat.",
        "judul": "Doa Menjelang Shalat Shubuh",
        "source": "harian"
    },
    {
        "arab": "اَصْبَحْنَاوَاَصْبَحَ الْمُلْكُ لِلَّهِ عَزَّ وَجَلَّ وَالحَْمْدُ للهِ وَالْكِبْرِيَاء وَالْعَظَمَة لِلَّهِ وَالخَْلْقُ وَاْلاَمْرُ وَاللَّيْلُ وَالنَّهَارُ وَمَا سَكَنَ فِيْهِمَا لِلَّهِ تَعَالَى. اللَّهُمَّ اجْعَلْ اَوَّلَ هَذَا النَّهَارِ صَلاَحًا وَاَوْسَطَه نَجَاحًا وَآخِرَه فَلاَحًا يَا اَرْحَمَ الرَّاحِمِين",
        "indo": "Kami telah mendapatkan Subuh dan jadilah segala kekuasaan kepunyaan Allah, demikian juga kebesaran dan keagungan, penciptaan makhluk, segala urusan, malam dansiang dan segala yang terjadi pada keduanya, semuanya kepunyaan Allah Ta’ala. Ya Allah, jadikanlah permulaan hari ini suatu kebaikan dan pertengahannya suatu kemenangan dan penghabisannya suatu kejayaan, wahai Tuhan yang paling Penyayang dari segala penyayang.",
        "judul": "Doa Menyambut Datangnya Pagi",
        "source": "harian"
    },
    {
        "arab": "اللَّهُمَّ إنِّي أَسْأَلُكَ عِلْماً نَافِعاً، وَرِزْقاً طَيِّباً، وَعَمَلاً مُتَقَبَّلاً",
        "indo": "Ya Allah, Sesungguhnya aku memohon kepada-Mu ilmu yang bermanfaat, rezeki yang baik dan amalan yang diterima.",
        "judul": "Doa Mohon Ilmu yang Bermanfaat",
        "source": "harian"
    },
    {
        "arab": "أَمْسَيْنَا وَأَمْسَى المُلْكُ للهِ، وَالحَمْدُ للهِ، لَا إِلَهَ إِلَّا اللهُ وَحْدَهُ لَا شَرِيْكَ لَهُ لَهُ المُلْكُ وَلَهُ الحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيْرٌ، رَبِّ أَسْأَلُكَ خَيْرَ مَا فِي هَذِهِ اللَّيْلَةِ وَخَيْرَ مَا بَعْدَهَا وَأَعُوْذُ بِكَ مِنْ شَرِّ مَا فِي هَذِهِ اللَيْلَةِ وَشَرِّ مَا بَعْدَهَا، رَبِّ أَعُوذُ بِكَ مِنَ الكَسْلِ وَسُوْءِ الكِبَرِ، أَعُوذُ بِكَ مِنْ عَذَابٍ فِي النَّارِ وَعَذَابٍ فِي القَبْرِ",
        "indo": "Kami telah mendapatkan petang, dan jadilah kekuasaan dan segala puji kepunyaan Allah, tidak ada sekutu bagi-Nya. Ya Allah, sesungguhnya aku mohon kepada-Mu kebaikan malam ini dan kebaikan yang terdapat\npadanya dan aku berlindung dengan-Mu dari kejahatannya dan kejahatan yang terdapat padanya. Ya Allah, aku berlindung kepada-Mu dari malas, tua bangka, dan dari keburukan lanjut umur dan gangguan dunia dan azab kubur.",
        "judul": "Doa Menyambut Petang Hari",
        "source": "harian"
    },
    {
        "arab": "اَللهُمَّ اِنّىْ اَسْأَلُكَ خَيْرَالْمَوْلِجِ وَخَيْرَالْمَخْرَجِ بِسْمِ اللهِ وَلَجْنَا وَبِسْمِ اللهِ خَرَجْنَا وَعَلَى اللهِ رَبّنَا تَوَكَّلْنَا",
        "indo": "Ya Allah, sesungguhnya aku mohon kepada-Mu baiknya tempat masuk dan baiknya tempat keluar dengan menyebut nama Allah kami masuk, dan dengan menyebut nama Allah kami keluar dan kepada Allah Tuhan kami, kami bertawakkal.",
        "judul": "Doa Masuk Rumah",
        "source": "harian"
    },
    {
        "arab": "بِسْمِ اللهِ تَوَكَّلْتُ عَلَى اللهِ، لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللهِ",
        "indo": "Dengan nama Allah, aku bertawakkal kepada Allah. Tiada daya dan kekuatan kecuali dengan Allah.",
        "judul": "Doa Keluar Rumah",
        "source": "harian"
    },
    {
        "arab": "اللَّهُمَّ اجْعَلْ فِى قَلْبِى نُورًا وَفِى لِسَانِى نُورًا وَاجْعَلْ فِى سَمْعِى نُورًا وَاجْعَلْ فِى بَصَرِى نُورًا وَاجْعَلْ مِنْ خَلْفِى نُورًا وَمِنْ أَمَامِى نُورًا وَاجْعَلْ مِنْ فَوْقِى نُورًا وَمِنْ تَحْتِى نُورًا. اللَّهُمَّ أَعْطِنِى نُورًا",
        "indo": "Ya allah jadikanlah hatiku bercahaya, lisanku bercahaya, pendengaranku bercahaya, penglihatanku bercahaya. Jadikanlah Ya Allah belakangku bercahaya, depanku bercahaya, atasku bercahaya dan bawahku bercahaya. Ya Allah, berikanlah cahaya untukku.",
        "judul": "Doa Menuju Masjid",
        "source": "harian"
    },
    {
        "arab": "اَللّٰهُمَّ افْتَحْ لِيْ اَبْوَابَ رَحْمَتِكَ",
        "indo": "Ya Allah, bukalah untukku pintu-pintu rahmat-Mu.",
        "judul": "Doa Masuk Masjid",
        "source": "harian"
    },
    {
        "arab": "اَللّٰهُمَّ اِنِّى اَسْأَلُكَ مِنْ فَضْلِكَ",
        "indo": "Ya Allah, sesungguhnya aku memohon keutamaan dari-Mu.",
        "judul": "Doa Keluar Masjid",
        "source": "harian"
    },
    {
        "arab": "بِسْمِ اللهِ اَللّهُمَّ جَنِّبْنَا الشَّيْطَانَ وَجَنِّبِ الشَّيْطَانَ مَا رَزَقْتَنَا",
        "indo": "Dengan menyebut nama Allah, ya Allah jauhkanlah kami dari (gangguan) setan dan jauhkanlah setan dari rezeki yang Engkau anugerahkan kepada kami.",
        "judul": "Doa Ketika Hendak Bersetubuh",
        "source": "harian"
    },
    {
        "arab": "باسْمِ اللَّهِ اللَّهُمَّ إنِّي أسألُكَ خَيْرَ هَذِهِ السُّوقِ وَخَيْرَ ما فِيها وأعُوذُ بِكَ مِنْ شَرّها وَشَرّ مَا فِيهَا اللَّهُمَّ إنِّي أعُوذُ بِكَ أنْ أُصِيبَ فِيْهَا يَمِيْناً فاجِرَةً أوْ صَفْقَةً خَاسِرَةً",
        "indo": "Dengan nama Allah, ya Allah, aku memohon kebaikan dari pasar ini dan kebaikan dari apa yang ada di dalamnya. Aku berlindung dari keburukan pasar ini dan keburukan apa yang ada di dalamnya. Ya Allah, aku berlindung dari sumpah palsu dan transaksi yang merugikan.",
        "judul": "Doa Masuk Pasar",
        "source": "harian"
    },
    {
        "arab": "اَللَّهُمَّ اجْعَلْ نَفْسِيْ مُطْمَئِنَّةً، تُؤْمِنُ بِلِقَائِكَ، وَتَرْضَى بِقَضَائِكَ",
        "indo": "Ya Allah, jadikan jiwa kami menjadi tenang, beriman akan adanya pertemuan dengan-Mu, dan rela atas garis yang Engkau tentukan.",
        "judul": "Doa Agar Tidak Pikun",
        "source": "harian"
    },
    {
        "arab": "اللَّهُمَّ غَارَتِ النُّجُومُ وَهَدَأَتِ الْعُيُونُ وَأَنْتَ حَيٌّ قَيُّومٌ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ يَا حَيُّ يَا قَيُّومُ أَهْدِئْ لَيْلِيْ وَأَنِمْ عَيْنِي",
        "indo": "Ya Allah, sunyilah semua \r\nbintang dan tenanglah semua mata, dan Tuhan \r\nyang hidup dan berdiri sendiri. Tuhan tidak \r\nmengantuk dan tidak tidur. Wahai Tuhan yang \r\nhidup dan berdiri sendiri. Tenangkanlah \r\nmalamku ini dan tidurkanlah mataku.",
        "judul": "Doa Susah Tidur",
        "source": "harian"
    },
    {
        "arab": "اللَّهُمَّ أَحْيِنِي مَا كَانَتِ الْحَيَاةُ خَيْرًا لِي، وَتَوَفَّنِي إِذَا كَانَتِ الْوَفَاةُ خَيْرًا لِي",
        "indo": "Ya Allah, hidupkanlah aku selama kehidupan itu baik bagiku, dan wafatkanlah aku selama wafat itu baik bagiku.",
        "judul": "Doa Pasien yang Tidak Ada Harapan Sembuh Lagi (dibaca pasien)",
        "source": "harian"
    },
    {
        "arab": "اللَّهُمَّ أَحْيِهِ مَا كَانَتِ الْحَيَاةُ خَيْرًا لَهُ، وَتَوَفَّهُ إِذَا كَانَتِ الْوَفَاةُ خَيْرًا لَهُ",
        "indo": "Ya Allah, hidupkanlah dia selama kehidupan itu baik baginya, dan wafatkanlah dia selama wafat itu baik baginya.",
        "judul": "Doa Pasien yang Tidak Ada Harapan Sembuh Lagi (dari orang lain & keluarga)",
        "source": "harian"
    },
    {
        "arab": "أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ. اللَّهُمَّ اجْعَلْنِى مِنَ التَّوَّابِينَ وَاجْعَلْنِى مِنَ الْمُتَطَهِّرِينَ وَاجْعَلنِى مِن عِبَادِكَ الصَّالِحِيْن",
        "indo": "Aku bersaksi bahwa tiada Tuhan selain Allah yang Maha Esa dan tiada sekutu bagi-Nya. Dan aku bersaksi bahwa Muhammad adalah hamba dan utusan-Nya. Ya Allah, jadikanlah aku termasuk orang yang bertaubat dan jadikanlah aku termasuk orang yang menyucikan diri, dan jadikanlah aku termasuk orang yang soleh.",
        "judul": "Doa Sesudah Wudhu",
        "source": "ibadah"
    },
    {
        "arab": "اللّٰهُمَّ رَبَّ هٰذِهِ الدَّعْوَةِ التَّامَّةِ وَالصَّلَاةِ الْقَائِمَةِ آتِ سَيِّدَنَـامُحَمـَّدًا الْوَسِيلَةَ وَالْفَضِيلَةَ وَالدَّرَجَةَ الرَّفِيْعَةَ وَابْعَثْهُ مَقَامًا المَحْمُودًا الَّذِيْ وَعَدْتَهُ إِنَّكَ لَا تُخْلِفُ الْمِيْعَادَ",
        "indo": "Ya Allah, Rabb pemilik seruan yang sempurna ini (adzan), dan sholat yang ditegakkan, berikan lah kepada Nabi Muhammad al-wasilah (kedudukan mulia di sisi-Mu) dan keutamaan, dirikan untuknya tempat terpuji seperti yang telah Engkau janjikan kepadanya.",
        "judul": "Doa Setelah Mendengar Adzan",
        "source": "ibadah"
    },
    {
        "arab": "رَبِّ أَعُوذُ بِكَ مِنْ هَمَزَاتِ الشَّيَاطِينِ وَأَعُوذُ بِكَ رَبِّ أَنْ يَحْضُرُونِ",
        "indo": "Ya Tuhanku aku berlindung kepada Engkau dari bisikan-bisikan setan. Dan aku berlindung (pula) kepada Engkau ya Tuhanku, dari kedatangan mereka kepadaku.",
        "judul": "Doa Sebelum Shalat",
        "source": "ibadah"
    },
    {
        "arab": "اَللّٰهُمَّ اِنَّ الضُّحَآءَ ضُحَاءُكَ وَالْبَهَاءَ بَهَاءُكَ وَالْجَمَالَ جَمَالُكَ وَالْقُوَّةَ قُوَّتُكَ وَالْقُدْرَةَ قُدْرَتُكَ وَالْعِصْمَةَ عِصْمَتُكَ اَللّٰهُمَّ اِنْ كَانَ رِزْقِى فِى السَّمَآءِ فَأَنْزِلْهُ وَاِنْ كَانَ فِى اْلاَرْضِ فَأَخْرِجْهُ وَاِنْ كَانَ مُعَسَّرًا فَيَسِّرْهُ وَاِنْ كَانَ حَرَامًا فَطَهِّرْهُ وَاِنْ كَانَ بَعِيْدًا فَقَرِّبْهُ بِحَقِّ ضُحَاءِكَ وَبَهَاءِكَ وَجَمَالِكَ وَقُوَّتِكَ وَقُدْرَتِكَ آتِنِىْ مَآاَتَيْتَ عِبَادَكَ الصَّالِحِيْنَ",
        "indo": "Wahai Tuhanku, sesungguhnya waktu Dhuha adalah waktu Dhuha-Mu, keagungan adalah keagungan-Mu, keindahan adalah keindahan-Mu, kekuatan adalah kekuatan-Mu, dan kekuasaan adalah kekuasaan-Mu serta penjagaan adalah penjagaan-Mu. Ya Allah, jika rizqiku masih di atas langit, turunkanlah dan jika ada di dalam bumi, keluarkanlah. Jika sukar mudahkanlah, jika haram sucikanlah, jika masih jauh dekatkanlah, berkat waktu Dhuha, keagungan, keindahan, kekuatan dan kekuasaan-Mu, limpahkanlah kepada kami segala yang telah Engkau limpahkan kepada hamba-hamba-Mu yang saleh.",
        "judul": "Doa Sesudah Shalat Dhuha",
        "source": "ibadah"
    },
    {
        "arab": "اَللّٰهُمَّ إِنِّيْ أَسْتَخِيْرُكَ بِعِلْمِكَ، وَأَسْتَقْدِرُكَ بِقُدْرَتِكَ، وَأَسْأَلُكَ مِنْ فَضْلِكَ الْعَظِيْمِ، فَإِنَّكَ تَقْدِرُ وَلَا أَقْدِرُ، وَتَعْلَمُ وَلَا أَعْلَمُ، وَأَنْتَ عَلَّامُ الْغُيُوْبِ. اَللّٰهُمَّ إِنْ كُنْتَ تَعْلَمُ أَنَّ هٰذَا اْلأَمْرَ .... خَيْرٌ لِيْ فِيْ دِيْنِيْ وَمَعَاشِيْ وَعَاقِبَةِ أَمْرِيْ فَاقْدُرْهُ لِيْ وَيَسِّرْهُ لِيْ ثُمَّ بَارِكْ لِيْ فِيْهِ، وَإِنْ كُنْتَ تَعْلَمُ أَنَّ هٰذَا اْلأَمْرَ شَرٌّ لِيْ فِيْ دِيْنِيْ وَمَعَاشِيْ وَعَاقِبَةِ أَمْرِيْ فَاصْرِفْهُ عَنِّيْ وَاصْرِفْنِيْ عَنْهُ وَاقْدُرْ لِيَ الْخَيْرَ حَيْثُ كَانَ ثُمَّ أَرْضِنِيْ بِهِ",
        "indo": "Ya Allah, sesungguhnya aku meminta pilihan yang tepat kepada-Mu dengan ilmu pengetahuan-Mu dan aku mohon kekuasaan-Mu (untuk mengatasi persoalanku) dengan kemahakuasaan-Mu. Aku mohon kepada-Mu sesuatu dari anugerah-Mu Yang Maha Agung, sesungguhnya Engkau Mahakuasa, sedang aku tidak kuasa, Engkau mengetahui, sedang aku tidak mengetahuinya dan Engkau adalah Maha Mengetahui hal yang ghaib. Ya Allah, apabila Engkau mengetahui bahwa urusan ini (orang yang mempunyai hajat hendaknya menyebut persoalannya) lebih baik dalam agamaku, dan akibatnya terhadap diriku sukseskanlah untuk ku, mudahkan jalannya, kemudian berilah berkah. Akan tetapi apabila Engkau mengetahui bahwa persoalan ini lebih berbahaya bagiku dalam agama, perekonomian dan akibatnya kepada diriku, maka singkirkan persoalan tersebut, dan jauhkan aku daripadanya, takdirkan kebaikan untuk ku di mana saja kebaikan itu berada, kemudian berilah kerelaan-Mu kepadaku.",
        "judul": "Doa Setelah Shalat Istikharah",
        "source": "ibadah"
    },
    {
        "arab": "اَللهُمَّ رَبَّنَا لَكَ الْحَمْدُ اَنْتَ قَيِّمُ السَّمَوَاتِ وَاْلاَرْضِ وَمَنْ فِيْهِنَّ. وَلَكَ الْحَمْدُ اَنْتَ مَلِكُ السَّمَوَاتِ واْلاَرْضِ وَمَنْ فِيْهِنَّ. وَلَكَ الْحَمْدُ اَنْتَ نُوْرُ السَّمَوَاتِ وَاْلاَرْضِ وَمَنْ فِيْهِنَّ. وَلَكَ الْحَمْدُ اَنْتَ الْحَقُّ وَوَعْدُكَ الْحَقُّ وَلِقَاءُكَ حَقٌّ وَقَوْلُكَ حَقٌّ وَالْجَنَّةُ حَقٌّ وَالنَّارُ حَقٌّ وَالنَّبِيُّوْنَ حَقٌّ وَمُحَمَّدٌ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ حَقٌّ وَالسَّاعَةُ حَقٌّ. اَللهُمَّ لَكَ اَسْلَمْتُ وَبِكَ اَمَنْتُ وَعَلَيْكَ تَوَكَّلْتُ وَاِلَيْكَ اَنَبْتُ وَبِكَ خَاصَمْتُ وَاِلَيْكَ حَاكَمْتُ فَاغْفِرْلِيْ مَاقَدَّمْتُ وَمَا اَخَّرْتُ وَمَا اَسْرَرْتُ وَمَا اَعْلَنْتُ وَمَا اَنْتَ اَعْلَمُ بِهِ مِنِّيْ. اَنْتَ الْمُقَدِّمُ وَاَنْتَ الْمُؤَخِّرُ لاَاِلَهَ اِلاَّ اَنْتَ. وَلاَ حَوْلَ وَلاَ قُوَّةَ اِلاَّ بِاللهِ",
        "indo": "Ya Allah, Tuhan kami, segala puji bagi-Mu, Engkau penegak langit, bumi, dan makhluk di dalamnya. Segala puji bagi-Mu, Engkau penguasa langit, bumi, dan makhluk di dalamnya. Segala puji bagi-Mu, Engkau cahaya langit, bumi, dan makhluk di dalamnya. Segala puji bagi-Mu, Engkau Maha Benar. Janji-Mu benar. Pertemuan dengan-Mu kelak itu benar. Firman-Mu benar adanya. Surga itu nyata. Neraka pun demikian. Para nabi itu benar. Demikian pula Nabi Muhammad SAW itu benar. Hari Kiamat itu benar. Ya Tuhanku, hanya kepada-Mu aku berserah. Hanya kepada-Mu juga aku beriman. Kepada-Mu aku pasrah. Hanya kepada-Mu aku kembali. Karena-Mu aku rela bertikai. Hanya pada-Mu dasar putusanku. Karenanya ampuni dosaku yang telah lalu dan yang terkemudian, dosa yang kusembunyikan dan yang kunyatakan, dan dosa lain yang lebih Kau ketahui ketimbang aku. Engkau Yang Maha Terdahulu dan Engkau Yang Maha Terkemudian. Tiada Tuhan selain Engkau. Tiada daya upaya dan kekuatan selain pertolongan Allah.",
        "judul": "Doa Setelah Shalat Tahajud",
        "source": "ibadah"
    },
    {
        "arab": "اَللّٰهُمَّ هٰذَا حَرَمُكَ وَأَمْنُكَ فَحَرِّمْ لَحْمِيْ وَدَمِيْ وَشَعْرِيْ وَبَشَرِيْ عَلَى النَّارِ وَاٰمِنِّيْ مِنْ عَذَابِكَ يَوْمَ تَبْعَثُ عِبَادَكَ وَاجْعَلْنِيْ مِنْ أَوْلِيَآئِكَ وَأَهْلِ طَاعَتِكَ",
        "indo": "Ya Allah kota ini adalah tanah Haram-Mu dan tempat yang aman, maka hindarkanlah daging, darah, rambut, bulu dan kulitku dari neraka. Amankanlah aku dari siksa-Mu pada hari Engkau membangkitkan aku ke dalam golongan aulia-Mu dan ahli ta’at pada-Mu.",
        "judul": "Doa Masuk kota Mekkah",
        "source": "haji"
    },
    {
        "arab": "اَللّٰهُمَّ أَنْتَ السَّلَامُ وَمِنْكَ السَّلَامُ فَحَيِّنَا رَبَّنَا بِالسَّلَامِ وَأَدْخِلْنَا الْجَنَّةَ دَارَالسَّلَامَ تَبَارَكْتَ وَتَعَالَيْتَ يَا ذَاالْجَلَالِ وَاْلإِكْرَامِ. اَللّٰهُمَّ افْتَحْ لِيْ أَبْوَابَ رَحْمَتِكَ وَمَغْفِرَتِكَ وَأَدْخِلْنِيْ فِيْهَا. بِسْمِ اللهِ وَالْحَمْدُ ِللهِ وَالصَّلَاةُ وَالسَّلَامُ عَلٰى رَسُوْلِ اللهِ",
        "indo": "Ya Allah, Engkau sumber keselamatan dan dari-Mulah datangnya keselamatan, hidupkanlah kami wahai Tuhan kami dengan keselamatan, dan tempatkanlah kami pada surga, negeri keselamatan. Maha banyak anugerah-Mu dan Maha Tinggi Engkau wahai Tuhan yang memiliki keagungatan dan kehormatan. Ya Allah ampunilah dosa-dosaku dan bukakanlah pintu-pintu rahmat-Mu. (Aku masuk masjid ini) dengan Nama Allah disertai segala puji bagi Allah, serta salawat dan salamat untuk Rasulullah SAW.",
        "judul": "Doa Masuk Masjidil Haram",
        "source": "haji"
    },
    {
        "arab": "اللَّهُمَّ زِدْ هَذَا الْبَيْتَ تَشْرِيفًا وَتَعْظِيمًا وَتَكْرِيمًا وَمَهَابَةً وَزِدْ مَنْ شَرّفَهُ وَكَرّمَهُ مِمَّنْ حَجَّهُ أَوِاعْتَمَرَهُ تَشْرِيفًا وَتَكْرِيمًا وَتَعْظِيمًا وَبِرًّا",
        "indo": "Ya Allah, tambahkanlah kemuliaan, kehormatan, keagungan dan kehebatan pada Baitullah ini dan tambahkanlah pula pada orang-orang yang memuliakan, menghormati dan mengagungkannya diantara mereka yang berhaji atau yang berumroh padanya dengan kemuliaan, kehormatan, kebesaran dan kebaikan.",
        "judul": "Doa Ketika Melihat Ka'bah",
        "source": "haji"
    },
    {
        "arab": "اللَّهُمَّ هَذَا حَرَامُ رَسُولِكَ وَاجْعَلْهُ وِقَايَةً مِنَ النَّارِ َوأَمَنَةً مِنَ الْعَذَابِ وَسُوءَ الحِسَابِ",
        "indo": "Ya Allah, negeri ini adalah tanah haram Rasul Mu Muhammad SAW, maka jadikanlah penjaga bagiku dari neraka, aman dari siksa dan buruknya hisab (perhitungan di hari kemudian.",
        "judul": "Doa Masuk Kota Madinah",
        "source": "haji"
    },
    {
        "arab": "سُبْحَانَ اللهِ وَالْحَمْدُ لِلَّهِ وَلَا اِلَهَ اِلَّا اللهُ وَاللهُ اَكْبَرْ وَلَا حَوْلَ وَلَا قُوَّةَ اِلِّا بِااللهِ الْعَلِيِّ الْعَظِيْمِ",
        "indo": "Maha Suci Allah, segala puji milik Allah tidak ada Tuhan melainkan Allah, Allah Maha Besar dan tiada daya dan kekuatan melainkan atas pertolongan Allah yang Maha Tingi dan Maha Agung.",
        "judul": "Doa Thawaf",
        "source": "haji"
    },
    {
        "arab": "سُبْحَانَ اللهِ وَالْحَمْدُ لِلَّهِ وَلَا إِلَهَ إِلَّا اللهَ اللهُ أَكْبَرُ. وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللهِ الْعَلِيِّ الْعَظِيْمِ. وَالصَّلَاةُ وَالسَّلاَمُ عَلَى رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ. اللَّهُمَّ إِيْمَانًا بِكَ وَتَصَدِّيْقًا بِكِتَابِكَ وَوَفَاءاً بِعِبَادِكَ وَاتِّبَاعًا لِسُنَّةِ نَبِيِّكَ مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ. اللَّهُمَّ إِنِّي أَسْئَلُكَ الْعَفْوَى وَالْعَافِيَةَ الدَّائِمَةَ فِي الدِّيْنِ وَالدُّنْيَا وَالْأَخِرَةَ وَالْفَوْزَ بِالْجَنَّةِ وَالنَّجَاةِ مِنَ النَّارِ",
        "indo": "Maha suci Allah, segala bentuk pujian hanya pantas disanjungkan kepada-Nya, sebab tiada Tuhan selain Allah, Dzat Yang Maha Besar. Tidak ada daya dan kekuatan kecuali berasal dari sisi-Nya yang Maha Mulia lagi Maha Agung. Shalawat serta salam semoga senantiasa tertuju kepada Rasulullah, sebagaimana Allah selalu mencurahkan shalawat dan salam kepada beliau. Ya Allah, aku melakukan tawaf ini hanya karena beriman kepada-Mu, membenarkan kitab-Mu, dan memenuhi janjiku pada-Mu, serta mengikuti sunnah Nabi-Mu Muhammad Saw. Ya Allah, sesungguhnya aku memohon ampunan kepada-Mu, kesehatan, danperlindungan yang kekal dalam menjalankan aturan agama, baik urusan dunia maupun akhiratku, juga untuk beroleh kenikmatan surga dan terhindar dari azab neraka.",
        "judul": "Doa Thawaf 1",
        "source": "haji"
    },
    {
        "arab": "اللَّهُمَّ إِنََ هَذَا الْبَيْتَ بَيْتُكَ وَالْحَرَاَم حَرَامُكَ وَالْأَمْنَ أَمْنُكَ وَالْعَبْدَ عَبْدُكَ وَأَنَا عَبْدُكَ وَابْنُ عَبْدِكَ وَهَذَا مَقَامُ عَيْذُكَ بِكَ مِنْ النَّارِ فَحَرِّمْ لُحُومُنَا وَبَشِّرْنَا عَلَى النَّارِ اللَّهُمَّ حَبِّبْ إِلَيْنَا الْإيْمَانَ وَزَيِّنْهُ فِي قَلُوبِنَا وَكَرِّهْ إِلَيْنَا الْكُفْرَ وَالْفُسُوقَ وَالْعِصْيَانَ وَاجْعَلْنَا مِنَ الرَّاشِدِينَ اللَّهُمَّ قِنِي عَذَابَكَ الْيَوْمَ تَبْعَثُ عِبَادَكَ اللُّهُمَّ ارْزُقْنَا الْجَنَّةَ بِغَيْرِ حِسَابٍ",
        "indo": "Ya Allah, sesungguh ya Ka’bah ini adalah rumah-Mu, tanah yang mulia di sekitarnya adalah tanah-Mu, negeri yang aman ini adalah negeri-Mu, hamba ini adalah hamba-Mu, anak dari hamba-Mu, dan tempat ini adalah tempat para hamba berlindung kepada-Mu dari siksa api neraka. Haramkanlah daging dan kulit kami dari jilatan api neraka. Ya Allah, cintakanlah kami kepada iman dan biarkanlah keimanan itu menghiasi hati kami. Tanamkanlah kebencian terhadap perbuatan kufur, fasik, dan durhaka kepada-Mu, dan masukkanlah kami ke dalam golongan hamba-Mu yang mendapat petunjuk. Ya Allah, lindungilah aku dari azab-Mu pada hari Engkau kelak membangkitkan hamba-hamba-Mu. Ya Allah, anugerahkanlah surga kepadaku tanpa melalui perhitungan.",
        "judul": "Doa Thawaf 2",
        "source": "haji"
    },
    {
        "arab": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِن الشَّكِّ وَالشِرْكِ والشِّقَاقِ والنِّفَاقِ وسُوءِ الأَخْلاَقِ وَسُوءِ المَنْظَرِ وَالمُنْقَلِبِ فِي المَالِ والأَهْلِ والوَلَدِ اللَّهُمَّ إِنِّي أَسْألُكَ رِضَاكَ والجَنَّةَ وأَعُوذُبِكَ مِن سَخَطِكَ والنَّارِ وَاالهَمِّ إِنِّي أَعُوذُبِكَ مِنْ فِتْنَةِ القُبُرِ وأَعُوذُ بِكَ مِن فِتْنَةِ المَحْيَا والمَمَاتِ",
        "indo": "Ya Allah, aku berlindung kepada-Mu dari keraguan syirik, bantah-bantahan, kemunafikan, akhlak yang buruk, dan penampilan serta kondisi kembali yang buruk, dalam hubungannya dengan harta benda, keluarga, dan anak-anak. Ya Allah, sesungguhnya aku memohon kepada-Mu keridhaan-Mu dan surga. Aku juga berlindung kepada-Mu dari murka-Mu dan siksa api neraka. Ya Allah, aku berlidung kepada-Mu dari fitnah kehidupan dan derita kematian.",
        "judul": "Doa Thawaf 3",
        "source": "haji"
    },
    {
        "arab": "اللَّهُمَّ اجْعَلْنِي حَجًّا مَبْرُورًا وَسَعْياً مَشْكُورًا وَذُنُباً مَغْفُورًا وَعَمَلًا صَالِحًا مَقْبُولًا وَتِجًارَةً لًنْ تَبُورًا. يَا عَالِمً مَا فِي الصُّدُورِِ أَخْرِجْنِي مِن الظُّلُمَاتِ إِلَى النُورِ، اللَّهُمَّ إِنِّي أَسْأَلُكَ مُوجِبَاتِ رَحْمَتِكَ وَعَزَائِمَ مَغْفِرَتِكَ وَالسَّلاَمَةَ مِن كُلِّ إِثْمٍ والغَنِيمَةَ مِن كُلِّ بِرٍّ والفَوْزَ بِالجَنَّةِ مِن النَّارِ رَبِّي قَنِّعْنِي بِمَا رَزَفَنِي وَبَارِكْ لِي فِيمَا أَعْطَيْتَنِي وَاخْلُفْ عَلَيْنَا كُلَّ غَيْبَةٍ مِنْكَ بِخَيْرٍ",
        "indo": "Ya Allah, karunikanlah kepada kami haji yang mabrur, sa’i yang diterima, dosa yang diampuni, amal saleh yang diterima, dan usaha yang tidak mengalami kerugian. Wahai Tuhan Yang Maha Mengetahui segala yang terkandung dalam sanubari, keluarkanlah aku dari kegelapan menuju cahaya yang terang bendenrang. Ya Allah, aku memohon kepada-Mu segala urusan yang mendatangkan kasih sayang-Mu dan keteguhan ampunan-Mu, selamat dari segala desa dan beruntung karena memperoleh surga dan terhindar dari siksa api neraka. Ya Tuhanku, puaskanlah aku dengan anugerah yang telah Engkau berikan dan berkatilah untukku semua yang Engkau anugerahkan anugerahkan kepadaku dan gantilah segala yang terlepas dari pandanganku dengan kebaikan yang berasal dari sisi-Mu.",
        "judul": "Doa Thawaf 4",
        "source": "haji"
    },
    {
        "arab": "أللَّهُمَّ أَظِلَّنِي تَحْتَ ظِلِّ عَرْشِكَ يَوْمَ لاَ ظِلَّ إِلَّا ظِلَّكَ وَلَا بَقِيَ إِلَّا وَجْهَكَ وَأَسْفِنِي مِنْ حَوْضِ نَبِيِّكَ مُحَمَّدٍ صَلَّى اللهُ عَلَيْكَ وسَلَّم شُرْبَةً هَنِيئَةً مَرِيئَةً لَا أَظَؤُ بَعْدَهَا أَبَدًا. أللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ خَيْرٍ مَا سَأَلَكَ مِنهُ نَبِيُّكَ مُحَمَّدٌ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَعُوُذُبِكَ مِنْ شَرِّ مَا عَاذَكَ مِنْهُ نَبِيُّكَ مُحَمَّدٌ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ اللَّهُمَّ إِنِّي أَسْأَلُكَ الجَنَّةَ وَنَعِيمَهَا وَمَا يُقَرِّبُنِي إِلَيْهَا مِنْ قَوْلٍ أَوْ فِعْلٍ أَوْ عَمَلٍ وَأَعُوذُبِكَ مِنَ النَّارِ وَمَا يُقَرِّبُنِي إِلَيْهَا مِنْ قَوْلٍ أَْو فِعْلٍ أَوْ عَمَلٍ",
        "indo": "Ya Allah, lindungilah aku di bawah naungan singgasana-Mu pada hari ketika tak ada naungan selain naungan-Mu dan tidak ada yang kekal kecuali Dzat-Mu. Berikanlah aku minuman dari telaga Nabi-Mu, Muhammad Saw dengan minuman yang lezat, segar, dan nyaman, yang sesudah itu aku tidak akan merasa kehausan selamanya. Ya Allah, aku memohon kepada-Mu kebaikan yang domohonkan oleh Nabi-Mu, Muhammad Saw dan keburukan yang dimintakan perlindungan kepada-Mu. Ya Allah, aku memohon kepada-Mu surga serta kenikmatannya dan apa saja yang dapat mendekatkan aku kepadanya, baik ucapan maupun perbuatan, dan aku juga berlindung kepada-Mu dari api neraka serta apa saya yang mendekatkan aku kepadanya baik ucapan maupun perbuatan.",
        "judul": "Doa Thawaf 5",
        "source": "haji"
    },
    {
        "arab": "اللَّهُمَّ إِنَّا لَكَ عَلَيَّ حُقُوقًا كَثِيرًا فِيمَا بَيْنِي وَبَيْنَكَ وَحُقُوقًا كثيرا فِيمَا بَيْنِي وَبَيْنَ خَلْقِكَ الَّلهُمَّ مَا كَانَ لَكَ مِنْهَا فَاغْفِرْهُ لِي وَمَا كَانَ لِخَلْقِكَ وَتَحَمَّلَهُ عَنِّي وَأَغْنِنِي بِحَلَالِكَ عَنْ حَرَامِكَ وَبِطَاعَتِكَ عنْ مَعْصِيَتِكَ وَبِفَضْلِكَ عَمَّنْ سِوَاكَ يَا وَاسِعَ المَغْفِرَةِ اللََّهُمَّ إِنَّ بَيْتَكَ عَظِيمٌ وَوَجْهَكَ كَرِيْمٌ وَأَنْتَ يَا اللَّهُمََّ حَلِيمٌ كَرِيمٌ عَظِيمٌ تُحِبُّ العَفْوَ فَاعْفُ عَنَّا",
        "indo": "Ya Allah, sesungguhnya Eanhkau mempunyai banyak sekali hak dalam hubunganku dengan-Mu dan dengan makhluk-Mu. Ya Allah, apa yang menjadi hak-Mu kepadaku maka ampunilah diriku jika melalikannya. dan apa saja yang menjadi hak-Mu kepada makhluk-Mu maka tangguhkanlah dariku. Cukupkanlah aki dengan rezeki darisisi-Mu yang halal, terhindar dari kemaksiatan, dan dengan anugerah-Mu aku terhindar dari harapan terhadap selain Engkau, wahai Zat yang Maha Pengampun. Ya ALlah, sesungguhnya rumah-Mu (Ka’bah) ini sangat agung, Zat-Mu pun Maha Mulia, Engkau penyabar, Maha Pemurah, dan Maha Agung, serta sangat suka memberi ampunan, maafkan dan ampunilah aku.",
        "judul": "Doa Thawaf 6",
        "source": "haji"
    },
    {
        "arab": "اللَّهُمَّ إِنِّي أَسْأَلُكَ إِيْمَاناً كَامِلًا وَيَقِينًا صَادِقًا وَرِزْقًا وَاسِعًا وَقَلْبًا خَاشِعًا ولِسَانًا ذَاكِرًا وَحَلَالًا طَيِّبًا وَتَوْبَةً نَصُوحًا وَتَوْبَةً قَبْلَ المَوْتِ وَرَاحَةً عِنْدَ المَوْتِ وَمَغْفِرَةً وَرَحْمَةً بَعْدَ الَموْتِ وَالْعَفْوَ عِنْدَ الحِساَبِ واَلفَوْزَ بِالْجَنَّةِ وَالنَّجَاةِ مِنَ النَّارِ بِرَحْمَتِكَ يَا عَزِيْزُ بِاْلصَالِحِينَ",
        "indo": "Ya Allah, aku memohon kepada-Mu iman yang sempurna, keyakinan yang benar, rezeki yang luas, hati yang khusuk, lisan yang selalu berzikir mengagungkan nama-Mu, rezeki yang halal dan baik, taubat yang diterima, taubat sebelum mati, ampunan pada saat diadakan perhitungan amal, keberuntungan memperoleh surga, rahmat dan kasih sayang-Mu, wahai Tuhan yang Maha Perkasa lagi Maha Pengampun. Ya Allah, berilah aku tambahan ilmu pengetahuan dan gabungkanlah aku ke dalam hamba-hamba-Mu yang saleh.",
        "judul": "Doa Thawaf 7",
        "source": "haji"
    },
    {
        "arab": "اللَّهُمَّ يَا رَبَّ البَيْتِ العَتِيْقِ، اَعْتِقْ رِقَابَنَا، وَرِقَابَ آبَائِنَا، وَأُمَّهَاتِنَا وَإخْوَانِنَا وَأَوْلاَدِنَا مِنْ النَارِ، يَا ذَا الجُوْدِ وَالكَرَمِ وَالفَضْلِ وَالمَنِّ وَالعَطَاءِ والإحْسَانِ اللَّهُمَّ أحْسِنْ عاقِبَتَنا في الأمُورِ كُلِّها، وأجِرْنا مِنْ خَزْي الدُّنْيَا وَعَذابِ الآخِرَةِ اللَّهُمَّ إِنِّيْ عَبْدُكَ وَابْنُ عَبْدِكَ، وَاقِفٌ تَحْتَ بَابِكَ مُلْتَزِمٌ بِأَعْتَابِكَ، مُتَذَلِّلٌ بَيْنَ يَدَيْكَ، أَرْجُو رَحْمَتَكَ، وَأَخْشَى عَذَابَكَ، يَاقَدِيْمَ الإِحْسَانِ اللَّهُمَّ إِنِّيْ أَسْألُكَ أَنْ تَرْفَعَ ذِكْرِيْ وَتَضَعَ وِزْرِيْ، وَتُصْلِحَ أَمْرِيْ، وَتُطَهِّرَ قَلْبِيْ، وَتُنَوِّرَ لِيْ فِيْ قَبْرِيْ، وَتَغْفِرَ لِيْ ذَنْبِيْ، وَأَسْألُكَ دَرَجَاتِ العُلَى مِنَ الجَنَّةِ",
        "indo": "Ya Allah, yang memelihara Ka’bah ini, bebaskanlah dari kami, bapak dan ibu kami, saudara-saudara dan anak-anak kami dari siksa neraka, wahai Tuhan Yang Maha Pemurah, Dermawan dan mempunyai keutamaan, kemulian, kelebihan, anugerah, pemberian dan kebaikan. Ya Allah, perbaikilah kesudahan segenap urusan kami dan jauhkanlah dari kehinaan dunia dan siksa di akhirat. Ya Allah, sesungguhnya aku adalah hamba-Mu, anak dari hamba-Mu, tegak merapat berdiri di bawah pintu Ka’bah-Mu menundukkan diri dihadapan-Mu sambil mengharapkan rahmat-Mu, kasih sayang-Mu, dan takut akan siksa-Mu. Wahai Tuhan pemilik kebaikan abadi, aku mohon pada-Mu agar Engkau tinggikan namaku, hapuskan dosaku, perbaiki segala urusanku, bersihkan hatiku berikan cahaya kelak dalam kuburku. Ampunilah dosaku dan aku mohon pada-Mu martabat yang tinggi didalam surga.",
        "judul": "Doa Setelah Thawaf",
        "source": "haji"
    },
    {
        "arab": "الله اكبر، الله اكبر ، الله اكبر، اللَّهُمَّ اسْتَعْمَلْنِيْ بِسُنَةِ نَبِيِّكَ وَتَوَفَّنِيْ عَلَى مِلَّتِهِ وَأعِدْنِيْ مِنْ مُضِلَّاتِ الْفِتَنِ",
        "indo": "Ya Allah, bimbinglah kami untuk beramal sesuai dengan sunnah Nabi-Mu dan matikanlah kami dalam keadaan Islam dan hindarkanlah kami dari fitnah/ujian yang menyesatkan.",
        "judul": "Doa Sa'i",
        "source": "haji"
    },
    {
        "arab": "اللَّهُمَّ إِنِّي أُحَرِّمُ نَفْسِي مِنْ كُلِّ مَا حَرَّمْتَ عَلَى الْمُحْرِمِ فَارْحَمْنِي يَا أَرْحَمَ الرَّاحِمِيْنَ",
        "indo": "Ya Allah, sesungguhnya aku mengharamkan diriku dari segala yang Engkau haramkan kepada orang yang berihram, karena itu rahmatilah aku wahai Allah Yang Maha Pemberi Rahmat.",
        "judul": "Doa Ihram",
        "source": "haji"
    },
    {
        "arab": "أَكْثَرُ مَا دَعَا بِهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَشِيَّةَ عَرَفَةَ فِي الْمَوْقِفِ : ” اللَّهُمَّ لَكَ الْحَمْدُ كَالَّذِي نَقُولُ وَخَيْرًا مِمَّا نَقُولُ ، اللَّهُمَّ لَكَ صَلَاتِي وَنُسُكِي وَمَحْيَايَ وَمَمَاتِي وَإِلَيْكَ مَآبِي وَلَكَ رَبِّ تُرَاثِي ، اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ وَوَسْوَسَةِ الصَّدْرِ وَشَتَاتِ الْأَمْرِ ، اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ مَا تَجِيءُ بِهِ الرِّيحُ",
        "indo": "Ya Allah, segala puji untukMu, seperti apa yang Engkau firmankan dan yang baik dari apa-apa yang kami ucapkan. Ya Allah, bagi-Mu shalatku, ibadahku, hidupku dan matiku dan kepada-Mu tempat kembaliku dan kepada-Mulah pemeliharaan apa yang aku tinggalkan. Ya Allah, aku berlindung kepadaMu dari siksa kubur, dan keragu-raguan dalam hati serta kesulitan segala urusan. Ya Allah, aku berlindung kepada-Mu dari kejahatan yang dihembuskan oleh angin.",
        "judul": "Doa Wukuf",
        "source": "haji"
    },
    {
        "arab": "سُبْحَانَكَ اللَّهُمَّ وَبِحَمْدِكَ، أَشْهَدُ أَنْ لاَ إِلَـٰهَ إِلاَّ أَنْتَ، أَسْتَغْفِرُكَ، وَأَتُوْبُ إِلَيْكَ",
        "indo": "Maha Suci Engkau ya Allah, aku memuji-Mu. Aku bersaksi bahwa tidak ada sesembahan yang berhak disembah kecuali Engkau, aku minta ampun dan bertaubat kepada-Mu.",
        "judul": "Doa Kafarah Majlis",
        "source": "lainnya"
    },
    {
        "arab": "اَللَّهُمَّ إِنِّيْ أَسْتَغْفـِرُكَ مِنْ كُلِّ ذَنْبٍ تُبْتُ إِلَيْكَ مِنْهُ ثُمَّ عُدْتُ فِيْهِ وَأَسْتَغْفِرُكَ لِمَا وَعَدْتُكَ بِهِ مِنْ نَفْسِيْ ثُمَّ أَخْلَفْتُكَ فِيْهِ وَأَسْتَغْفِرُكَ لِمَا أَرَدْتُ بِهِ وَجْهَكَ الْكَرِيْمَ فَخَالَطَهُ غَيْرُكَ وَأَسْتَغْفِرُكَ مِنْ كُلِّ نِعْمَةٍ اَنْعَمْتَ عَلَيْهَا عَلَيَّ فَاسْتَعَنْتُ بِهَا عَلَى مَعْصِيَتِكَ وَأَسْتَغْفِرُكَ يَاعَالِمَ الْغَيْبِ وَالشَّهَادَةِ مِنْ كُلِّ ذَنْبٍ اَتَيْتُهُ فِيْ ضِيَاءِ النَّهَارِ وَسَوَادِ اللَّيْلِ، فِيْ مَلَإٍ وَخَلاَءٍ، وَسِـرٍّ وَعَلاَنِـيَّـةٍ يَاحَلِيْمُ",
        "indo": "Ya Allah, sesungguhnya aku meminta ampun kepada-Mu dari segala dosa yang mana aku telah bertaubat kepada-Mu namun aku mengulanginya lagi. Sesungguhnya aku meminta ampun kepada-Mu atas apa yang aku telah berjanji kepada-Mu kemudian aku khilaf kepada-Mu. Sesungguhnya aku meminta ampun kepada-Mu atas apa yang telah aku maksudkan untuk berbakti hanya kepada-Mu kemudian ada sesuatu selain dirimu yang mencampurinya. Sesungguhnya aku meminta ampun kepada-Mu atas semua nikmat yang telah Engkau berikan kepadaku namun aku gunakan untuk bermaksiat kepada-Mu. Sesungguhnya aku meminta kepada-Mu, wahai Dzat Yang Maha Mengetahui alam ghaib dan alam nyata, dari setiap dosa yang aku lakukan di siang hari dan di waku malam, dalam keadaan ramai dan keadaan sepi, dalam keadaan sembunyi dan terang-terangan, wahai Dzat Yang Maha Pengampun.",
        "judul": "Istighfar Nabi Khidir As",
        "source": "lainnya"
    },
    {
        "arab": "صَلَّى اللهُ عَلَى نَبِيِّنَا مُحَمَّدٍ كُلَّمَا ذَكَرَهُ الذَّاكِرُوْنَ وَغَفَلَ عَنْ ذِكْرِهِ الْغَافِلُوْنَ",
        "indo": "Ya Allah, limpahkanlah shalawat atas nabi kami, Nabi Muhammad SAW, selama orang-orang yang ingat menyebut-Mu dan orang-orang yang lalai lupa untuk menyebut-Mu.",
        "judul": "Shalawat Pengampun Dosa",
        "source": "lainnya"
    },
    {
        "arab": "اَللّٰهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَاَنْزِلهُ الْمُنزَلَ الْمُقَرَّبَ مِنكَ يَومَ القِيَامَةِ ",
        "indo": "Ya Allah, limpahkanlah \r\nshalawat kepada Muhammad dan tempatkanlah \r\nia di tempat yang dekat dengan-Mu di hari \r\nakhirat.",
        "judul": "Shalawat Agar Mendapat Syafaat Rasulullah SAW",
        "source": "lainnya"
    },
    {
        "arab": "رَبَّنَا ظَلَمْنَا أَنفُسَنَا وَإِن لَّمْ تَغْفِرْ لَنَا وَتَرْحَمْنَا لَنَكُونَنَّ مِنَ الْخَاسِرِينَ",
        "indo": "Ya Tuhan kami, kami telah menzhalimi diri kami sendiri. Jika Engkau tidak mengampuni kami dan memberi rahmat kepada kami, niscaya kami termasuk orang-orang yang rugi.",
        "judul": "Doa Taubatan Nasuha (Doa Nabi Adam)",
        "source": "lainnya"
    },
    {
        "arab": "اللَّهُمَّ إِنِّي ظَلَمْتُ نَفْسِي ظُلْمًا كَثِيرًا، وَلاَ يَغْفِرُ الذُّنُوبَ إِلاَّ أَنْتَ فَاغْفِرْ لِي مَغْفِرَةً مِنْ عِنْدِكَ، وَارْحَمْنِي، إِنَّكَ أَنْتَ الْغَفُورُ الرَّحِيمُ",
        "indo": "Ya Allah, sungguh aku telah menzhalimi diriku sendiri dengan kezhaliman yang banyak, sedangkan tidak ada yang dapat mengampuni dosa-dosa kecuali Engkau. Maka itu ampunilah aku dengan suatu pengampunan dari sisi-Mu, dan rahmatilah aku. Sesungguhnya Engkau Maha Pengampun lagi Maha Penyayang.",
        "judul": "Doa Pembersih Seluruh Dosa",
        "source": "lainnya"
    },
    {
        "arab": "رَّبِّ أَدْخِلْنِى مُدْخَلَ صِدْقٍ وَأَخْرِجْنِى مُخْرَجَ صِدْقٍ وَٱجْعَل لِّى مِن لَّدُنكَ سُلْطَٰنًا نَّصِيرًا",
        "indo": "Ya Tuhanku, masukkanlah aku ke dalam golongan yang benar dan keluarkanlah aku ke tempat orang-orang yang benar. Dan berikanlah aku di sisi-Mu kekuasaan (pemimpin) yang menolong.",
        "judul": "Doa Mohon Ketenteraman",
        "source": "lainnya"
    },
    {
        "arab": "اَللّٰهُمَّ مَٰلِكَ ٱلْمُلْكِ تُؤْتِى ٱلْمُلْكَ مَن تَشَآءُ وَتَنزِعُ ٱلْمُلْكَ مِمَّن تَشَآءُ وَتُعِزُّ مَن تَشَآءُ وَتُذِلُّ مَن تَشَآءُ ۖ بِيَدِكَ ٱلْخَيْرُ ۖ إِنَّكَ عَلَىٰ كُلِّ شَىْءٍ قَدِيرٌ",
        "indo": "Wahai Dzat yang memiliki seluruh kerajaan, Engkau yang memberikan kerajaan, harta dan kekuasaan di bumi bagi orang-orang yang Engkau kehendaki dari hamba-hamba Mu, dan Engkau pula yang mengambil kerajaan dari orang-orang yang Engkau kehendaki, dan Engkau memberikan kemuliaan di dunia dan di akhirat bagi siapa saja yang Engkau kehendaki, dan Engkau menjadikan kehinaan kepada orang yang Engkau kehendaki, di tangan Mu lah segala kebaikan, Sesungguhnya Engkau lah satu-satunya Dzat yang maha kuasa atas segala sesuatu.",
        "judul": "Doa Mohon Kedudukan",
        "source": "lainnya"
    }
]