[
    {
        "ayat_arab": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
        "ayat_indo": "Dengan nama Allah Yang Maha Pengasih, Maha Penyayang.",
        "ayat_latin": "Bismillaahir Rahmaanir Raheem",
        "name": "Juz 1",
        "name_end_arab": "البقرة",
        "name_end_id": "Al-Baqarah",
        "name_start_arab": "الفاتحة",
        "name_start_id": "Al-Fatihah",
        "number": "1",
        "surah_id_end": "2",
        "surah_id_start": "1",
        "verse_end": "141",
        "verse_start": "1"
    },
    {
        "ayat_arab": "۞ سَيَقُولُ السُّفَهَاءُ مِنَ النَّاسِ مَا وَلَّاهُمْ عَن قِبْلَتِهِمُ الَّتِي كَانُوا عَلَيْهَا ۚ قُل لِّلَّهِ الْمَشْرِقُ وَالْمَغْرِبُ ۚ يَهْدِي مَن يَشَاءُ إِلَىٰ صِرَاطٍ مُّسْتَقِيمٍ",
        "ayat_indo": "Orang-orang yang kurang akal di antara manusia akan berkata, “Apakah yang memalingkan mereka (Muslim) dari kiblat yang dahulu mereka (berkiblat) kepadanya?” Katakanlah (Muhammad), “Milik Allah-lah timur dan barat; Dia memberi petunjuk kepada siapa yang Dia kehendaki ke jalan yang lurus.”",
        "ayat_latin": "Sayaqoolus sufahaaa'u minan naasi maa wallaahum 'an Qiblatihimul latee kaanoo 'alaihaa; qulo lillaahil mashriqu walmaghrib; yahdee mai yashaaa'u ilaa Siraatim Mustaqeem",
        "name": "Juz 2",
        "name_end_arab": "البقرة",
        "name_end_id": "Al-Baqarah",
        "name_start_arab": "البقرة",
        "name_start_id": "Al-Baqarah",
        "number": "2",
        "surah_id_end": "2",
        "surah_id_start": "2",
        "verse_end": "252",
        "verse_start": "142"
    },
    {
        "ayat_arab": "۞ تِلْكَ الرُّسُلُ فَضَّلْنَا بَعْضَهُمْ عَلَىٰ بَعْضٍ ۘ مِّنْهُم مَّن كَلَّمَ اللَّهُ ۖ وَرَفَعَ بَعْضَهُمْ دَرَجَاتٍ ۚ وَآتَيْنَا عِيسَى ابْنَ مَرْيَمَ الْبَيِّنَاتِ وَأَيَّدْنَاهُ بِرُوحِ الْقُدُسِ ۗ وَلَوْ شَاءَ اللَّهُ مَا اقْتَتَلَ الَّذِينَ مِن بَعْدِهِم مِّن بَعْدِ مَا جَاءَتْهُمُ الْبَيِّنَاتُ وَلَٰكِنِ اخْتَلَفُوا فَمِنْهُم مَّنْ آمَنَ وَمِنْهُم مَّن كَفَرَ ۚ وَلَوْ شَاءَ اللَّهُ مَا اقْتَتَلُوا وَلَٰكِنَّ اللَّهَ يَفْعَلُ مَا يُرِيدُ",
        "ayat_indo": "Rasul-rasul itu Kami lebihkan sebagian mereka dari sebagian yang lain. Di antara mereka ada yang (langsung) Allah berfirman dengannya dan sebagian lagi ada yang ditinggikan-Nya beberapa derajat. Dan Kami beri Isa putra Maryam beberapa mukjizat dan Kami perkuat dia dengan Rohulkudus. Kalau Allah menghendaki, niscaya orang-orang setelah mereka tidak akan berbunuh-bunuhan, setelah bukti-bukti sampai kepada mereka. Tetapi mereka berselisih, maka ada di antara mereka yang beriman dan ada (pula) yang kafir. Kalau Allah menghendaki, tidaklah mereka berbunuh-bunuhan. Tetapi Allah berbuat menurut kehendak-Nya.",
        "ayat_latin": "Tilkar Rusulu faddalnaa ba'dahum 'alaa ba'd; minhum man kallamal laahu wa rafa'a ba'dahum darajaat; wa aatainaa 'Eesab na Maryamal baiyinaati wa ayyadnaahu bi Roohil Qudus; wa law shaaa'al laahu maqtatalal lazeena mimba'dihim mim ba'di maa jaaa'athumul baiyinaatu wa laakinikh talafoo faminhum man aamana wa minhum man kafar; wa law shaaa'al laahu maq tataloo wa laakinnallaaha yaf'alu maa yureed (",
        "name": "Juz 3",
        "name_end_arab": "آل عمران",
        "name_end_id": "Ali 'Imran",
        "name_start_arab": "البقرة",
        "name_start_id": "Al-Baqarah",
        "number": "3",
        "surah_id_end": "3",
        "surah_id_start": "2",
        "verse_end": "92",
        "verse_start": "253"
    },
    {
        "ayat_arab": "۞ كُلُّ الطَّعَامِ كَانَ حِلًّا لِّبَنِي إِسْرَائِيلَ إِلَّا مَا حَرَّمَ إِسْرَائِيلُ عَلَىٰ نَفْسِهِ مِن قَبْلِ أَن تُنَزَّلَ التَّوْرَاةُ ۗ قُلْ فَأْتُوا بِالتَّوْرَاةِ فَاتْلُوهَا إِن كُنتُمْ صَادِقِينَ",
        "ayat_indo": "Semua makanan itu halal bagi Bani Israil, kecuali makanan yang diharamkan oleh Israil (Yakub) atas dirinya sebelum Taurat diturunkan. Katakanlah (Muhammad), “Maka bawalah Taurat lalu bacalah, jika kamu orang-orang yang benar.”",
        "ayat_latin": "Kullut ta'aami kaana hillal li Baneee Israaa'eela illaa maa harrama Israaa'eelu 'alaa nafsihee min qabli an tunzzalat Tawraah; qul faatoo bit Tawraati fatloohaaa in kuntum saadiqeen",
        "name": "Juz 4",
        "name_end_arab": "النساء",
        "name_end_id": "An-Nisa'",
        "name_start_arab": "آل عمران",
        "name_start_id": "Ali 'Imran",
        "number": "4",
        "surah_id_end": "4",
        "surah_id_start": "3",
        "verse_end": "23",
        "verse_start": "93"
    },
    {
        "ayat_arab": "۞ وَالْمُحْصَنَاتُ مِنَ النِّسَاءِ إِلَّا مَا مَلَكَتْ أَيْمَانُكُمْ ۖ كِتَابَ اللَّهِ عَلَيْكُمْ ۚ وَأُحِلَّ لَكُم مَّا وَرَاءَ ذَٰلِكُمْ أَن تَبْتَغُوا بِأَمْوَالِكُم مُّحْصِنِينَ غَيْرَ مُسَافِحِينَ ۚ فَمَا اسْتَمْتَعْتُم بِهِ مِنْهُنَّ فَآتُوهُنَّ أُجُورَهُنَّ فَرِيضَةً ۚ وَلَا جُنَاحَ عَلَيْكُمْ فِيمَا تَرَاضَيْتُم بِهِ مِن بَعْدِ الْفَرِيضَةِ ۚ إِنَّ اللَّهَ كَانَ عَلِيمًا حَكِيمًا",
        "ayat_indo": "Dan (diharamkan juga kamu menikahi) perempuan yang bersuami, kecuali hamba sahaya perempuan (tawanan perang) yang kamu miliki sebagai ketetapan Allah atas kamu. Dan dihalalkan bagimu selain (perempuan-perempuan) yang demikian itu jika kamu berusaha dengan hartamu untuk menikahinya bukan untuk berzina. Maka karena kenikmatan yang telah kamu dapatkan dari mereka, berikanlah maskawinnya kepada mereka sebagai suatu kewajiban. Tetapi tidak mengapa jika ternyata di antara kamu telah saling merelakannya, setelah ditetapkan. Sungguh, Allah Maha Mengetahui, Mahabijaksana.",
        "ayat_latin": "Walmuhsanaatu minan nisaaa'i illaa maa malakat aimaanukum kitaabal laahi 'alaikum; wa uhilla lakum maa waraaa'a zaalikum an tabtaghoo bi amwaali kum muhsineena ghaira musaa fiheen; famastamta'tum bihee minhunna fa aatoohunna ujoorahunna fareedah; wa laa junaaha 'alaikum feemaa taraadaitum bihee mim ba'dil fareedah; innal laaha kaana 'Aleeman Hakeemaa",
        "name": "Juz 5",
        "name_end_arab": "النساء",
        "name_end_id": "An-Nisa'",
        "name_start_arab": "النساء",
        "name_start_id": "An-Nisa'",
        "number": "5",
        "surah_id_end": "4",
        "surah_id_start": "4",
        "verse_end": "147",
        "verse_start": "24"
    },
    {
        "ayat_arab": "۞ لَّا يُحِبُّ اللَّهُ الْجَهْرَ بِالسُّوءِ مِنَ الْقَوْلِ إِلَّا مَن ظُلِمَ ۚ وَكَانَ اللَّهُ سَمِيعًا عَلِيمًا",
        "ayat_indo": "Allah tidak menyukai perkataan buruk, (yang diucapkan) secara terus terang kecuali oleh orang yang dizalimi. Dan Allah Maha Mendengar, Maha Mengetahui.",
        "ayat_latin": "Laa yuhibbullaahul jahra bis sooo'i minal qawli illaa man zulim; wa kaanallaahu Samee'an 'Aleeman",
        "name": "Juz 6",
        "name_end_arab": "المائدة",
        "name_end_id": "Al-Ma'idah",
        "name_start_arab": "النساء",
        "name_start_id": "An-Nisa'",
        "number": "6",
        "surah_id_end": "5",
        "surah_id_start": "4",
        "verse_end": "81",
        "verse_start": "148"
    },
    {
        "ayat_arab": "۞ لَتَجِدَنَّ أَشَدَّ النَّاسِ عَدَاوَةً لِّلَّذِينَ آمَنُوا الْيَهُودَ وَالَّذِينَ أَشْرَكُوا ۖ وَلَتَجِدَنَّ أَقْرَبَهُم مَّوَدَّةً لِّلَّذِينَ آمَنُوا الَّذِينَ قَالُوا إِنَّا نَصَارَىٰ ۚ ذَٰلِكَ بِأَنَّ مِنْهُمْ قِسِّيسِينَ وَرُهْبَانًا وَأَنَّهُمْ لَا يَسْتَكْبِرُونَ",
        "ayat_indo": "Pasti akan kamu dapati orang yang paling keras permusuhannya terhadap orang-orang yang beriman, yaitu orang-orang Yahudi dan orang-orang musyrik. Dan pasti akan kamu dapati orang yang paling dekat persahabatannya dengan orang-orang yang beriman ialah orang-orang yang berkata, “Sesungguhnya kami adalah orang Nasrani.” Yang demikian itu karena di antara mereka terdapat para pendeta dan para rahib, (juga) karena mereka tidak menyombongkan diri.",
        "ayat_latin": "Latajidanna ashad dan naasi 'adaawatal lillazeena aamanul Yahooda wallazeena ashrakoo wa latajidanna aqrabahum mawaddatal lil lazeena aamanul lazeena qaalooo innaa Nasaaraa; zaalika bi anna mminhum qiseeseena wa ruhbaananw wa annahum laa yastakbiroon",
        "name": "Juz 7",
        "name_end_arab": "الأنعام",
        "name_end_id": "Al-An'am",
        "name_start_arab": "المائدة",
        "name_start_id": "Al-Ma'idah",
        "number": "7",
        "surah_id_end": "6",
        "surah_id_start": "5",
        "verse_end": "110",
        "verse_start": "82"
    },
    {
        "ayat_arab": "۞ وَلَوْ أَنَّنَا نَزَّلْنَا إِلَيْهِمُ الْمَلَائِكَةَ وَكَلَّمَهُمُ الْمَوْتَىٰ وَحَشَرْنَا عَلَيْهِمْ كُلَّ شَيْءٍ قُبُلًا مَّا كَانُوا لِيُؤْمِنُوا إِلَّا أَن يَشَاءَ اللَّهُ وَلَٰكِنَّ أَكْثَرَهُمْ يَجْهَلُونَ",
        "ayat_indo": "Dan sekalipun Kami benar-benar menurunkan malaikat kepada mereka, dan orang yang telah mati berbicara dengan mereka dan Kami kumpulkan (pula) di hadapan mereka segala sesuatu (yang mereka inginkan), mereka tidak juga akan beriman, kecuali jika Allah menghendaki. Tapi kebanyakan mereka tidak mengetahui (arti kebenaran).",
        "ayat_latin": "Wa law annanaa nazzal naaa ilaihimul malaaa'ikata wa kallamahumul mawtaa wa hasharnaa 'alaihim kulla shai'in qubulam maa kaanoo liyu'minooo illaaa ai yashaaa'al laahu wa laakinna aksarahum yajhaloon",
        "name": "Juz 8",
        "name_end_arab": "الأعراف",
        "name_end_id": "Al-A'raf",
        "name_start_arab": "الأنعام",
        "name_start_id": "Al-An'am",
        "number": "8",
        "surah_id_end": "7",
        "surah_id_start": "6",
        "verse_end": "87",
        "verse_start": "111"
    },
    {
        "ayat_arab": "۞ قَالَ الْمَلَأُ الَّذِينَ اسْتَكْبَرُوا مِن قَوْمِهِ لَنُخْرِجَنَّكَ يَا شُعَيْبُ وَالَّذِينَ آمَنُوا مَعَكَ مِن قَرْيَتِنَا أَوْ لَتَعُودُنَّ فِي مِلَّتِنَا ۚ قَالَ أَوَلَوْ كُنَّا كَارِهِينَ",
        "ayat_indo": "Pemuka-pemuka yang menyombongkan diri dari kaum Syuaib berkata, “Wahai Syuaib! Pasti kami usir engkau bersama orang-orang yang beriman dari negeri kami, kecuali engkau kembali kepada agama kami.”Syuaib berkata, “Apakah (kamu akan mengusir kami), kendatipun kami tidak suka?",
        "ayat_latin": "Qaalal mala ul lazeenas takbaroo min qawmihee lanukhrijannaka yaa Shu'aibu wallazeena aamanoo ma'aka min qaryatinaaa aw lata'oo dunna fee millatinaa; qaala awa law kunnaa kaariheen",
        "name": "Juz 9",
        "name_end_arab": "الأنفال",
        "name_end_id": "Al-Anfal",
        "name_start_arab": "الأعراف",
        "name_start_id": "Al-A'raf",
        "number": "9",
        "surah_id_end": "8",
        "surah_id_start": "7",
        "verse_end": "40",
        "verse_start": "88"
    },
    {
        "ayat_arab": "۞ وَاعْلَمُوا أَنَّمَا غَنِمْتُم مِّن شَيْءٍ فَأَنَّ لِلَّهِ خُمُسَهُ وَلِلرَّسُولِ وَلِذِي الْقُرْبَىٰ وَالْيَتَامَىٰ وَالْمَسَاكِينِ وَابْنِ السَّبِيلِ إِن كُنتُمْ آمَنتُم بِاللَّهِ وَمَا أَنزَلْنَا عَلَىٰ عَبْدِنَا يَوْمَ الْفُرْقَانِ يَوْمَ الْتَقَى الْجَمْعَانِ ۗ وَاللَّهُ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ",
        "ayat_indo": "Dan ketahuilah, sesungguhnya segala yang kamu peroleh sebagai rampasan perang, maka seperlima untuk Allah, Rasul, kerabat Rasul, anak yatim, orang miskin dan ibnu sabil, (demikian) jika kamu beriman kepada Allah dan kepada apa yang Kami turunkan kepada hamba Kami (Muhammad) di hari Furqan, yaitu pada hari bertemunya dua pasukan. Allah Mahakuasa atas segala sesuatu.",
        "ayat_latin": "Wa'lamooo annamaa ghanimtum min sha'in fa anna lillaahi khumusahoo wa lir Rasooli wa lizil qurba walyataamaa walmasaakeeni wabnis sabeeli in kuntum aamantum billaahi wa maaa anzalnaa 'ala 'abdinaa yawmal Furqaani yawmaltaqal jam'aan; wal laahu 'alaa kulli shai'in Qadeer",
        "name": "Juz 10",
        "name_end_arab": "التوبة",
        "name_end_id": "At-Taubah",
        "name_start_arab": "الأنفال",
        "name_start_id": "Al-Anfal",
        "number": "10",
        "surah_id_end": "9",
        "surah_id_start": "8",
        "verse_end": "92",
        "verse_start": "41"
    },
    {
        "ayat_arab": "۞ إِنَّمَا السَّبِيلُ عَلَى الَّذِينَ يَسْتَأْذِنُونَكَ وَهُمْ أَغْنِيَاءُ ۚ رَضُوا بِأَن يَكُونُوا مَعَ الْخَوَالِفِ وَطَبَعَ اللَّهُ عَلَىٰ قُلُوبِهِمْ فَهُمْ لَا يَعْلَمُونَ",
        "ayat_indo": "Sesungguhnya alasan (untuk menyalahkan) hanyalah terhadap orang-orang yang meminta izin kepadamu (untuk tidak ikut berperang), padahal mereka orang kaya. Mereka rela berada bersama orang-orang yang tidak ikut berperang dan Allah telah mengunci hati mereka, sehingga mereka tidak mengetahui (akibat perbuatan mereka).",
        "ayat_latin": "Innamas sabeelu 'alal lazeena yastaazinoonaka wa hum aghniyaaa'; radoo biany-yakoonoo ma'al khawaalifi wa taba'al laahu 'alaa quloobihim fahum laa ya'lamoon",
        "name": "Juz 11",
        "name_end_arab": "هود",
        "name_end_id": "Hud",
        "name_start_arab": "التوبة",
        "name_start_id": "At-Taubah",
        "number": "11",
        "surah_id_end": "11",
        "surah_id_start": "9",
        "verse_end": "5",
        "verse_start": "93"
    },
    {
        "ayat_arab": "۞ وَمَا مِن دَابَّةٍ فِي الْأَرْضِ إِلَّا عَلَى اللَّهِ رِزْقُهَا وَيَعْلَمُ مُسْتَقَرَّهَا وَمُسْتَوْدَعَهَا ۚ كُلٌّ فِي كِتَابٍ مُّبِينٍ",
        "ayat_indo": "Dan tidak satupun makhluk bergerak (bernyawa) di bumi melainkan semuanya dijamin Allah rezekinya. Dia mengetahui tempat kediamannya dan tempat penyimpanannya. Semua (tertulis) dalam Kitab yang nyata (Lauh Mahfuzh).",
        "ayat_latin": "Wa maa min daaabbatin fil ardi illaa 'alal laahi rizquhaa wa ya'lamu mustaqarrahaa wa mustawda'ahaa; kullun fee Kitaabim Mubeen",
        "name": "Juz 12",
        "name_end_arab": "يوسف",
        "name_end_id": "Yusuf",
        "name_start_arab": "هود",
        "name_start_id": "Hud",
        "number": "12",
        "surah_id_end": "12",
        "surah_id_start": "11",
        "verse_end": "52",
        "verse_start": "6"
    },
    {
        "ayat_arab": "۞ وَمَا أُبَرِّئُ نَفْسِي ۚ إِنَّ النَّفْسَ لَأَمَّارَةٌ بِالسُّوءِ إِلَّا مَا رَحِمَ رَبِّي ۚ إِنَّ رَبِّي غَفُورٌ رَّحِيمٌ",
        "ayat_indo": "Dan aku tidak (menyatakan) diriku bebas (dari kesalahan), karena sesungguhnya nafsu itu selalu mendorong kepada kejahatan, kecuali (nafsu) yang diberi rahmat oleh Tuhanku. Sesungguhnya Tuhanku Maha Pengampun, Maha Penyayang.",
        "ayat_latin": "Wa maa ubarri'u nafsee; innan nafsa la ammaaratum bissooo'i illaa maa rahima Rabbee; inna Rabbee Ghafoorur Raheem",
        "name": "Juz 13",
        "name_end_arab": "ابراهيم",
        "name_end_id": "Ibrahim",
        "name_start_arab": "يوسف",
        "name_start_id": "Yusuf",
        "number": "13",
        "surah_id_end": "14",
        "surah_id_start": "12",
        "verse_end": "52",
        "verse_start": "53"
    },
    {
        "ayat_arab": "الر ۚ تِلْكَ آيَاتُ الْكِتَابِ وَقُرْآنٍ مُّبِينٍ",
        "ayat_indo": "Alif Lam Ra. (Surah) ini adalah (sebagian dari) ayat-ayat Kitab (yang sempurna) yaitu (ayat-ayat) Al-Qur'an yang memberi penjelasan.",
        "ayat_latin": "Alif-Laaam-Raa; tilka Aayaatul Kitaabi wa Qur-aa-nim Mubeen",
        "name": "Juz 14",
        "name_end_arab": "النحل",
        "name_end_id": "An-Nahl",
        "name_start_arab": "ابراهيم",
        "name_start_id": "Ibrahim",
        "number": "14",
        "surah_id_end": "16",
        "surah_id_start": "15",
        "verse_end": "128",
        "verse_start": "1"
    },
    {
        "ayat_arab": "سُبْحَانَ الَّذِي أَسْرَىٰ بِعَبْدِهِ لَيْلًا مِّنَ الْمَسْجِدِ الْحَرَامِ إِلَى الْمَسْجِدِ الْأَقْصَى الَّذِي بَارَكْنَا حَوْلَهُ لِنُرِيَهُ مِنْ آيَاتِنَا ۚ إِنَّهُ هُوَ السَّمِيعُ الْبَصِيرُ",
        "ayat_indo": "Mahasuci (Allah), yang telah memperjalankan hamba-Nya (Muhammad) pada malam hari dari Masjidilharam ke Masjidil Aqsa yang telah Kami berkahi sekelilingnya agar Kami perlihatkan kepadanya sebagian tanda-tanda (kebesaran) Kami. Sesungguhnya Dia Maha Mendengar, Maha Melihat.",
        "ayat_latin": "Subhaanal lazeee asraa bi'abdihee lailam minal Masjidil Haraami ilal Masjidil Aqsal-lazee baaraknaa haw lahoo linuriyahoo min aayaatinaa;innahoo Huwas Samee'ul-Baseer",
        "name": "Juz 15",
        "name_end_arab": "الكهف",
        "name_end_id": "Al-Kahf",
        "name_start_arab": "الإسراء",
        "name_start_id": "Al-Isra'",
        "number": "15",
        "surah_id_end": "18",
        "surah_id_start": "17",
        "verse_end": "74",
        "verse_start": "1"
    },
    {
        "ayat_arab": "۞ قَالَ أَلَمْ أَقُل لَّكَ إِنَّكَ لَن تَسْتَطِيعَ مَعِيَ صَبْرًا",
        "ayat_indo": "Dia berkata, “Bukankah sudah kukatakan kepadamu, bahwa engkau tidak akan mampu sabar bersamaku?”",
        "ayat_latin": "Qaala alam aqul laka innaka lan tastatee'a ma'iya sabraa",
        "name": "Juz 16",
        "name_end_arab": "طه",
        "name_end_id": "Taha",
        "name_start_arab": "الكهف",
        "name_start_id": "Al-Kahf",
        "number": "16",
        "surah_id_end": "20",
        "surah_id_start": "18",
        "verse_end": "135",
        "verse_start": "75"
    },
    {
        "ayat_arab": "اقْتَرَبَ لِلنَّاسِ حِسَابُهُمْ وَهُمْ فِي غَفْلَةٍ مُّعْرِضُونَ",
        "ayat_indo": "Telah semakin dekat kepada manusia perhitungan amal mereka, sedang mereka dalam keadaan lalai (dengan dunia), berpaling (dari akhirat).",
        "ayat_latin": "Iqtaraba linnaasi hisaa buhum wa hum fee ghaflatim mu'ridoon",
        "name": "Juz 17",
        "name_end_arab": "الحج",
        "name_end_id": "Al-Hajj",
        "name_start_arab": "الأنبياء",
        "name_start_id": "Al-Anbiya'",
        "number": "17",
        "surah_id_end": "22",
        "surah_id_start": "21",
        "verse_end": "78",
        "verse_start": "1"
    },
    {
        "ayat_arab": "قَدْ أَفْلَحَ الْمُؤْمِنُونَ",
        "ayat_indo": "Sungguh beruntung orang-orang yang beriman,",
        "ayat_latin": "Qad aflahal mu'minoon",
        "name": "Juz 18",
        "name_end_arab": "الفرقان",
        "name_end_id": "Al-Furqan",
        "name_start_arab": "المؤمنون",
        "name_start_id": "Al-Mu'minun",
        "number": "18",
        "surah_id_end": "25",
        "surah_id_start": "23",
        "verse_end": "20",
        "verse_start": "1"
    },
    {
        "ayat_arab": "۞ وَقَالَ الَّذِينَ لَا يَرْجُونَ لِقَاءَنَا لَوْلَا أُنزِلَ عَلَيْنَا الْمَلَائِكَةُ أَوْ نَرَىٰ رَبَّنَا ۗ لَقَدِ اسْتَكْبَرُوا فِي أَنفُسِهِمْ وَعَتَوْا عُتُوًّا كَبِيرًا",
        "ayat_indo": "Dan orang-orang yang tidak mengharapkan pertemuan dengan Kami (di akhirat) berkata, “Mengapa bukan para malaikat yang diturunkan kepada kita atau (mengapa) kita (tidak) melihat Tuhan kita?” Sungguh, mereka telah menyombongkan diri mereka dan benar-benar telah melampaui batas (dalam melakukan kezaliman).",
        "ayat_latin": "Wa qaalal lazeena laa yarjoona liqaaa'anaa law laaa unzila 'alainal malaaa'ikatu awnaraa Rabbanaa; laqadistakbaroo feee anfusihim wa 'ataw 'utuwwan kabeeraa",
        "name": "Juz 19",
        "name_end_arab": "النمل",
        "name_end_id": "An-Naml",
        "name_start_arab": "الفرقان",
        "name_start_id": "Al-Furqan",
        "number": "19",
        "surah_id_end": "27",
        "surah_id_start": "25",
        "verse_end": "55",
        "verse_start": "21"
    },
    {
        "ayat_arab": "۞ فَمَا كَانَ جَوَابَ قَوْمِهِ إِلَّا أَن قَالُوا أَخْرِجُوا آلَ لُوطٍ مِّن قَرْيَتِكُمْ ۖ إِنَّهُمْ أُنَاسٌ يَتَطَهَّرُونَ",
        "ayat_indo": "Jawaban kaumnya tidak lain hanya dengan mengatakan, “Usirlah Lut dan keluarganya dari negerimu; sesungguhnya mereka adalah orang-orang yang (menganggap dirinya) suci.”",
        "ayat_latin": "Fammaa kaana jawaaba qawmiheee illaaa an qaalooo akrijoon aalaa Lootim min qaryatikum innahum unaasuny yatatahharoon",
        "name": "Juz 20",
        "name_end_arab": "العنكبوت",
        "name_end_id": "Al-'Ankabut",
        "name_start_arab": "النمل",
        "name_start_id": "An-Naml",
        "number": "20",
        "surah_id_end": "29",
        "surah_id_start": "27",
        "verse_end": "45",
        "verse_start": "56"
    },
    {
        "ayat_arab": "۞ وَلَا تُجَادِلُوا أَهْلَ الْكِتَابِ إِلَّا بِالَّتِي هِيَ أَحْسَنُ إِلَّا الَّذِينَ ظَلَمُوا مِنْهُمْ ۖ وَقُولُوا آمَنَّا بِالَّذِي أُنزِلَ إِلَيْنَا وَأُنزِلَ إِلَيْكُمْ وَإِلَٰهُنَا وَإِلَٰهُكُمْ وَاحِدٌ وَنَحْنُ لَهُ مُسْلِمُونَ",
        "ayat_indo": "Dan janganlah kamu berdebat dengan Ahli Kitab, melainkan dengan cara yang baik, kecuali dengan orang-orang yang zalim di antara mereka, dan katakanlah, ”Kami telah beriman kepada (kitab-kitab) yang diturunkan kepada kami dan yang diturunkan kepadamu; Tuhan kami dan Tuhan kamu satu; dan hanya kepada-Nya kami berserah diri.”",
        "ayat_latin": "Wa laa tujaadilooo Ahlal Kitaabi illaa billatee hiya ahsanu illal lazeena zalamoo minhum wa qoolooo aamannaa billazeee unzila ilainaa wa unzila ilaikum wa illaahunna wa illahukum waahidunw-wa nahnu lahoo muslimoon",
        "name": "Juz 21",
        "name_end_arab": "الأحزاب",
        "name_end_id": "Al-Ahzab",
        "name_start_arab": "العنكبوت",
        "name_start_id": "Al-'Ankabut",
        "number": "21",
        "surah_id_end": "33",
        "surah_id_start": "29",
        "verse_end": "30",
        "verse_start": "46"
    },
    {
        "ayat_arab": "۞ وَمَن يَقْنُتْ مِنكُنَّ لِلَّهِ وَرَسُولِهِ وَتَعْمَلْ صَالِحًا نُّؤْتِهَا أَجْرَهَا مَرَّتَيْنِ وَأَعْتَدْنَا لَهَا رِزْقًا كَرِيمًا",
        "ayat_indo": "Dan barangsiapa di antara kamu (istri-istri Nabi) tetap taat kepada Allah dan Rasul-Nya dan mengerjakan kebajikan, niscaya Kami berikan pahala kepadanya dua kali lipat dan Kami sediakan rezeki yang mulia baginya.",
        "ayat_latin": "Wa mai yaqnut minkunna lillaahi wa Rasoolihee wa ta'mal saalihan nu'tihaaa ajrahaa marratayni wa a'tadnaa lahaa rizqan kareema",
        "name": "Juz 22",
        "name_end_arab": "يس",
        "name_end_id": "Yasin",
        "name_start_arab": "الأحزاب",
        "name_start_id": "Al-Ahzab",
        "number": "22",
        "surah_id_end": "36",
        "surah_id_start": "33",
        "verse_end": "27",
        "verse_start": "31"
    },
    {
        "ayat_arab": "۞ وَمَا أَنزَلْنَا عَلَىٰ قَوْمِهِ مِن بَعْدِهِ مِن جُندٍ مِّنَ السَّمَاءِ وَمَا كُنَّا مُنزِلِينَ",
        "ayat_indo": "Dan setelah dia (meninggal), Kami tidak menurunkan suatu pasukan pun dari langit kepada kaumnya, dan Kami tidak perlu menurunkannya.",
        "ayat_latin": "Wa maaa anzalnaa 'alaa qawmihee mim ba'dihee min jundim minas-samaaa'i wa maa kunnaa munzileen",
        "name": "Juz 23",
        "name_end_arab": "الزمر",
        "name_end_id": "Az-Zumar",
        "name_start_arab": "يس",
        "name_start_id": "Yasin",
        "number": "23",
        "surah_id_end": "39",
        "surah_id_start": "36",
        "verse_end": "31",
        "verse_start": "28"
    },
    {
        "ayat_arab": "۞ فَمَنْ أَظْلَمُ مِمَّن كَذَبَ عَلَى اللَّهِ وَكَذَّبَ بِالصِّدْقِ إِذْ جَاءَهُ ۚ أَلَيْسَ فِي جَهَنَّمَ مَثْوًى لِّلْكَافِرِينَ",
        "ayat_indo": "Maka siapakah yang lebih zalim daripada orang yang membuat-buat kebohongan terhadap Allah dan mendustakan kebenaran yang datang kepadanya? Bukankah di neraka Jahanam tempat tinggal bagi orang-orang kafir?",
        "ayat_latin": "Faman azlamu mimman kazaba 'alal laahi wa kazzaba bissidqi iz jaaa'ah; alaisa fee Jahannama maswal lilkaafir",
        "name": "Juz 24",
        "name_end_arab": "فصلت",
        "name_end_id": "Fussilat",
        "name_start_arab": "الزمر",
        "name_start_id": "Az-Zumar",
        "number": "24",
        "surah_id_end": "41",
        "surah_id_start": "39",
        "verse_end": "46",
        "verse_start": "32"
    },
    {
        "ayat_arab": "۞ إِلَيْهِ يُرَدُّ عِلْمُ السَّاعَةِ ۚ وَمَا تَخْرُجُ مِن ثَمَرَاتٍ مِّنْ أَكْمَامِهَا وَمَا تَحْمِلُ مِنْ أُنثَىٰ وَلَا تَضَعُ إِلَّا بِعِلْمِهِ ۚ وَيَوْمَ يُنَادِيهِمْ أَيْنَ شُرَكَائِي قَالُوا آذَنَّاكَ مَا مِنَّا مِن شَهِيدٍ",
        "ayat_indo": "Kepada-Nyalah ilmu tentang hari Kiamat itu dikembalikan. Tidak ada buah-buahan yang keluar dari kelopaknya dan tidak seorang perempuan pun yang mengandung dan yang melahirkan, melainkan semuanya dengan sepengetahuan-Nya. Pada hari ketika Dia (Allah) menyeru mereka, “Dimanakah sekutu-sekutu-Ku itu?” Mereka menjawab, “Kami nyatakan kepada Engkau bahwa tidak ada seorang pun di antara kami yang dapat memberi kesaksian (bahwa Engkau mempunyai sekutu).”",
        "ayat_latin": "Ilaihi yuraddu 'ilmus Saaa'ah; wa maa takhruju min samaraatim min akmaamihaa wa maa tahmilu min unsaa wa laa tada'u illaa bi'ilmih; wa Yawma yunaadeehim aina shurakaaa'ee qaalooo aazannaaka maa minnaa min shaheed",
        "name": "Juz 25",
        "name_end_arab": "الجاثية",
        "name_end_id": "Al-Jasiyah",
        "name_start_arab": "فصلت",
        "name_start_id": "Fussilat",
        "number": "25",
        "surah_id_end": "45",
        "surah_id_start": "41",
        "verse_end": "37",
        "verse_start": "47"
    },
    {
        "ayat_arab": "حم",
        "ayat_indo": "Ha Mim",
        "ayat_latin": "Haa-Meeeeem",
        "name": "Juz 26",
        "name_end_arab": "الذاريات",
        "name_end_id": "Az-Zariyat",
        "name_start_arab": "الأحقاف",
        "name_start_id": "Al-Ahqaf",
        "number": "26",
        "surah_id_end": "51",
        "surah_id_start": "46",
        "verse_end": "30",
        "verse_start": "1"
    },
    {
        "ayat_arab": "۞ قَالَ فَمَا خَطْبُكُمْ أَيُّهَا الْمُرْسَلُونَ",
        "ayat_indo": "Dia (Ibrahim) berkata, “Apakah urusanmu yang penting wahai para utusan?”",
        "ayat_latin": "Qaala famaa khatbukum ayyuhal mursaloon",
        "name": "Juz 27",
        "name_end_arab": "الحديد",
        "name_end_id": "Al-Hadid",
        "name_start_arab": "الذاريات",
        "name_start_id": "Az-Zariyat",
        "number": "27",
        "surah_id_end": "57",
        "surah_id_start": "51",
        "verse_end": "29",
        "verse_start": "31"
    },
    {
        "ayat_arab": "قَدْ سَمِعَ اللَّهُ قَوْلَ الَّتِي تُجَادِلُكَ فِي زَوْجِهَا وَتَشْتَكِي إِلَى اللَّهِ وَاللَّهُ يَسْمَعُ تَحَاوُرَكُمَا ۚ إِنَّ اللَّهَ سَمِيعٌ بَصِيرٌ",
        "ayat_indo": "Sungguh, Allah telah mendengar ucapan perempuan yang mengajukan gugatan kepadamu (Muhammad) tentang suaminya, dan mengadukan (halnya) kepada Allah, dan Allah mendengar percakapan antara kamu berdua. Sesungguhnya Allah Maha Mendengar, Maha Melihat.",
        "ayat_latin": "Qad sami'al laahu qawlal latee tujaadiluka fee zawjihaa wa tashtakeee ilal laahi wallaahu yasma'u tahaawurakumaa; innal laaha samee'um baseer",
        "name": "Juz 28",
        "name_end_arab": "التحريم",
        "name_end_id": "At-Tahrim",
        "name_start_arab": "المجادلة",
        "name_start_id": "Al-Mujadalah",
        "number": "28",
        "surah_id_end": "66",
        "surah_id_start": "58",
        "verse_end": "12",
        "verse_start": "1"
    },
    {
        "ayat_arab": "تَبَارَكَ الَّذِي بِيَدِهِ الْمُلْكُ وَهُوَ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ",
        "ayat_indo": "Mahasuci Allah yang menguasai (segala) kerajaan, dan Dia Mahakuasa atas segala sesuatu.",
        "ayat_latin": "Tabaarakal lazee biyadihil mulku wa huwa 'alaa kulli shai-in qadeer",
        "name": "Juz 29",
        "name_end_arab": "المرسلات",
        "name_end_id": "Al-Mursalat",
        "name_start_arab": "الملك",
        "name_start_id": "Al-Mulk",
        "number": "29",
        "surah_id_end": "77",
        "surah_id_start": "67",
        "verse_end": "50",
        "verse_start": "1"
    },
    {
        "ayat_arab": "عَمَّ يَتَسَاءَلُونَ",
        "ayat_indo": "Tentang apakah mereka saling bertanya-tanya?",
        "ayat_latin": "'Amma Yatasaa-aloon",
        "name": "Juz 30",
        "name_end_arab": "الناس",
        "name_end_id": "An-Nas",
        "name_start_arab": "النبإ",
        "name_start_id": "An-Naba'",
        "number": "30",
        "surah_id_end": "114",
        "surah_id_start": "78",
        "verse_end": "6",
        "verse_start": "1"
    }
]